espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** AXI_IC_DATE_REG register
 *  Version Control Register
 */
#define AXI_IC_DATE_REG (DR_REG_AXI_IC_BASE + 0x0)
/** AXI_IC_REG_DATE : R/W; bitpos: [31:0]; default: 23050900;
 *  Version Control Register
 */
#define AXI_IC_REG_DATE    0xFFFFFFFFU
#define AXI_IC_REG_DATE_M  (AXI_IC_REG_DATE_V << AXI_IC_REG_DATE_S)
#define AXI_IC_REG_DATE_V  0xFFFFFFFFU
#define AXI_IC_REG_DATE_S  0

/** AXI_IC_CLK_EN_REG register
 *  AXI IC reg clk enable config register
 */
#define AXI_IC_CLK_EN_REG (DR_REG_AXI_IC_BASE + 0x4)
/** AXI_IC_REG_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  value 1 enable clk, value 0 disable clk, default 1
 */
#define AXI_IC_REG_CLK_EN    (BIT(0))
#define AXI_IC_REG_CLK_EN_M  (AXI_IC_REG_CLK_EN_V << AXI_IC_REG_CLK_EN_S)
#define AXI_IC_REG_CLK_EN_V  0x00000001U
#define AXI_IC_REG_CLK_EN_S  0

/** AXI_IC_INTERRUPT_RAW_REG register
 *  Interrupt raw of AXI IC  Interrupt register.
 */
#define AXI_IC_INTERRUPT_RAW_REG (DR_REG_AXI_IC_BASE + 0x8)
/** AXI_IC_REG_DEC_FAILURE_INT_RAW : R/SS/WTC; bitpos: [0]; default: 0;
 *  Interrupt raw of reg_dec_failure_int_raw
 */
#define AXI_IC_REG_DEC_FAILURE_INT_RAW    (BIT(0))
#define AXI_IC_REG_DEC_FAILURE_INT_RAW_M  (AXI_IC_REG_DEC_FAILURE_INT_RAW_V << AXI_IC_REG_DEC_FAILURE_INT_RAW_S)
#define AXI_IC_REG_DEC_FAILURE_INT_RAW_V  0x00000001U
#define AXI_IC_REG_DEC_FAILURE_INT_RAW_S  0
/** AXI_IC_REG_TIMEOUT_INT_RAW : R/SS/WTC; bitpos: [1]; default: 0;
 *  Interrupt raw of reg_timeout_int_raw
 */
#define AXI_IC_REG_TIMEOUT_INT_RAW    (BIT(1))
#define AXI_IC_REG_TIMEOUT_INT_RAW_M  (AXI_IC_REG_TIMEOUT_INT_RAW_V << AXI_IC_REG_TIMEOUT_INT_RAW_S)
#define AXI_IC_REG_TIMEOUT_INT_RAW_V  0x00000001U
#define AXI_IC_REG_TIMEOUT_INT_RAW_S  1

/** AXI_IC_INTERRUPT_CLR_REG register
 *  Interrupt clear of AXI IC  Interrupt register.
 */
#define AXI_IC_INTERRUPT_CLR_REG (DR_REG_AXI_IC_BASE + 0xc)
/** AXI_IC_REG_DEC_FAILURE_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Interrupt clr of reg_dec_failure_int_clr
 */
#define AXI_IC_REG_DEC_FAILURE_INT_CLR    (BIT(0))
#define AXI_IC_REG_DEC_FAILURE_INT_CLR_M  (AXI_IC_REG_DEC_FAILURE_INT_CLR_V << AXI_IC_REG_DEC_FAILURE_INT_CLR_S)
#define AXI_IC_REG_DEC_FAILURE_INT_CLR_V  0x00000001U
#define AXI_IC_REG_DEC_FAILURE_INT_CLR_S  0
/** AXI_IC_REG_TIMEOUT_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Interrupt clr of reg_timeout_int_clr
 */
#define AXI_IC_REG_TIMEOUT_INT_CLR    (BIT(1))
#define AXI_IC_REG_TIMEOUT_INT_CLR_M  (AXI_IC_REG_TIMEOUT_INT_CLR_V << AXI_IC_REG_TIMEOUT_INT_CLR_S)
#define AXI_IC_REG_TIMEOUT_INT_CLR_V  0x00000001U
#define AXI_IC_REG_TIMEOUT_INT_CLR_S  1

/** AXI_IC_INTERRUPT_ENA_REG register
 *  Interrupt enable of AXI IC  Interrupt register.
 */
#define AXI_IC_INTERRUPT_ENA_REG (DR_REG_AXI_IC_BASE + 0x10)
/** AXI_IC_REG_DEC_FAILURE_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Interrupt ena of reg_dec_failure_int_ena
 */
#define AXI_IC_REG_DEC_FAILURE_INT_ENA    (BIT(0))
#define AXI_IC_REG_DEC_FAILURE_INT_ENA_M  (AXI_IC_REG_DEC_FAILURE_INT_ENA_V << AXI_IC_REG_DEC_FAILURE_INT_ENA_S)
#define AXI_IC_REG_DEC_FAILURE_INT_ENA_V  0x00000001U
#define AXI_IC_REG_DEC_FAILURE_INT_ENA_S  0
/** AXI_IC_REG_TIMEOUT_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Interrupt ena of reg_timeout_int_ena
 */
#define AXI_IC_REG_TIMEOUT_INT_ENA    (BIT(1))
#define AXI_IC_REG_TIMEOUT_INT_ENA_M  (AXI_IC_REG_TIMEOUT_INT_ENA_V << AXI_IC_REG_TIMEOUT_INT_ENA_S)
#define AXI_IC_REG_TIMEOUT_INT_ENA_V  0x00000001U
#define AXI_IC_REG_TIMEOUT_INT_ENA_S  1

/** AXI_IC_INTERRUPT_ST_REG register
 *  AXI IC  Interrupt register.
 */
#define AXI_IC_INTERRUPT_ST_REG (DR_REG_AXI_IC_BASE + 0x14)
/** AXI_IC_REG_DEC_FAILURE_INT_ST : RO; bitpos: [0]; default: 0;
 *  Interrupt st of reg_dec_failure_int_st
 */
#define AXI_IC_REG_DEC_FAILURE_INT_ST    (BIT(0))
#define AXI_IC_REG_DEC_FAILURE_INT_ST_M  (AXI_IC_REG_DEC_FAILURE_INT_ST_V << AXI_IC_REG_DEC_FAILURE_INT_ST_S)
#define AXI_IC_REG_DEC_FAILURE_INT_ST_V  0x00000001U
#define AXI_IC_REG_DEC_FAILURE_INT_ST_S  0
/** AXI_IC_REG_TIMEOUT_INT_ST : RO; bitpos: [1]; default: 0;
 *  Interrupt st of reg_timeout_int_st
 */
#define AXI_IC_REG_TIMEOUT_INT_ST    (BIT(1))
#define AXI_IC_REG_TIMEOUT_INT_ST_M  (AXI_IC_REG_TIMEOUT_INT_ST_V << AXI_IC_REG_TIMEOUT_INT_ST_S)
#define AXI_IC_REG_TIMEOUT_INT_ST_V  0x00000001U
#define AXI_IC_REG_TIMEOUT_INT_ST_S  1

/** AXI_IC_TIMEOUT_MAX_CNT_REG register
 *  AXI IC core AW or AR channel timeout counter maximum value.
 */
#define AXI_IC_TIMEOUT_MAX_CNT_REG (DR_REG_AXI_IC_BASE + 0x18)
/** AXI_IC_REG_TIMEOUT_MAX_CNT : R/W; bitpos: [31:0]; default: 4294967295;
 *  AXI IC core AW or AR channel timeout counter maximum value.
 */
#define AXI_IC_REG_TIMEOUT_MAX_CNT    0xFFFFFFFFU
#define AXI_IC_REG_TIMEOUT_MAX_CNT_M  (AXI_IC_REG_TIMEOUT_MAX_CNT_V << AXI_IC_REG_TIMEOUT_MAX_CNT_S)
#define AXI_IC_REG_TIMEOUT_MAX_CNT_V  0xFFFFFFFFU
#define AXI_IC_REG_TIMEOUT_MAX_CNT_S  0

/** AXI_IC_TIMEOUT_INFO_REG register
 *  AXI IC core AW or AR channel timeout information.
 */
#define AXI_IC_TIMEOUT_INFO_REG (DR_REG_AXI_IC_BASE + 0x1c)
/** AXI_IC_REG_TIMEOUT_SLAVE : RO; bitpos: [2:0]; default: 0;
 *  bit[i] is 1 means slave[i] occurs timeout.
 */
#define AXI_IC_REG_TIMEOUT_SLAVE    0x00000007U
#define AXI_IC_REG_TIMEOUT_SLAVE_M  (AXI_IC_REG_TIMEOUT_SLAVE_V << AXI_IC_REG_TIMEOUT_SLAVE_S)
#define AXI_IC_REG_TIMEOUT_SLAVE_V  0x00000007U
#define AXI_IC_REG_TIMEOUT_SLAVE_S  0
/** AXI_IC_REG_TIMEOUT_ID : RO; bitpos: [9:3]; default: 0;
 *  (master id, awid)
 */
#define AXI_IC_REG_TIMEOUT_ID    0x0000007FU
#define AXI_IC_REG_TIMEOUT_ID_M  (AXI_IC_REG_TIMEOUT_ID_V << AXI_IC_REG_TIMEOUT_ID_S)
#define AXI_IC_REG_TIMEOUT_ID_V  0x0000007FU
#define AXI_IC_REG_TIMEOUT_ID_S  3
/** AXI_IC_REG_TIMEOUT_WR : RO; bitpos: [10]; default: 0;
 *  1 indicates write operation, 0 indicates read operation.
 */
#define AXI_IC_REG_TIMEOUT_WR    (BIT(10))
#define AXI_IC_REG_TIMEOUT_WR_M  (AXI_IC_REG_TIMEOUT_WR_V << AXI_IC_REG_TIMEOUT_WR_S)
#define AXI_IC_REG_TIMEOUT_WR_V  0x00000001U
#define AXI_IC_REG_TIMEOUT_WR_S  10

/** AXI_IC_DEC_FAILURE_INFO_REG register
 *  Default slave information get control and status.
 */
#define AXI_IC_DEC_FAILURE_INFO_REG (DR_REG_AXI_IC_BASE + 0x20)
/** AXI_IC_REG_DEC_FAILURE_READ_FIRST : R/W; bitpos: [0]; default: 0;
 *  Decoder failure recorded control. 1 means record read failure first, else write
 *  failure first.
 */
#define AXI_IC_REG_DEC_FAILURE_READ_FIRST    (BIT(0))
#define AXI_IC_REG_DEC_FAILURE_READ_FIRST_M  (AXI_IC_REG_DEC_FAILURE_READ_FIRST_V << AXI_IC_REG_DEC_FAILURE_READ_FIRST_S)
#define AXI_IC_REG_DEC_FAILURE_READ_FIRST_V  0x00000001U
#define AXI_IC_REG_DEC_FAILURE_READ_FIRST_S  0
/** AXI_IC_REG_DEC_FAILURE_VALID : RO; bitpos: [1]; default: 0;
 *  Decoder failure valid control.
 */
#define AXI_IC_REG_DEC_FAILURE_VALID    (BIT(1))
#define AXI_IC_REG_DEC_FAILURE_VALID_M  (AXI_IC_REG_DEC_FAILURE_VALID_V << AXI_IC_REG_DEC_FAILURE_VALID_S)
#define AXI_IC_REG_DEC_FAILURE_VALID_V  0x00000001U
#define AXI_IC_REG_DEC_FAILURE_VALID_S  1
/** AXI_IC_REG_DEC_FAILURE_TYPE : RO; bitpos: [2]; default: 0;
 *  Decoder failure type control. 0 means ar failure, 1 means aw failure.
 */
#define AXI_IC_REG_DEC_FAILURE_TYPE    (BIT(2))
#define AXI_IC_REG_DEC_FAILURE_TYPE_M  (AXI_IC_REG_DEC_FAILURE_TYPE_V << AXI_IC_REG_DEC_FAILURE_TYPE_S)
#define AXI_IC_REG_DEC_FAILURE_TYPE_V  0x00000001U
#define AXI_IC_REG_DEC_FAILURE_TYPE_S  2
/** AXI_IC_REG_DEC_FAILURE_CAUSE : RO; bitpos: [5:3]; default: 0;
 *  bit[0] is 0 means to access the mapped slave address, and is 1 means to access the
 *  unmapped slave address. bit[1] is 0 means to access the visible slave, and is 1
 *  means to access the invisible slave. bit[2] is 0 means to access the secure slave,
 *  and is 1 means to access the non-secure slave.
 */
#define AXI_IC_REG_DEC_FAILURE_CAUSE    0x00000007U
#define AXI_IC_REG_DEC_FAILURE_CAUSE_M  (AXI_IC_REG_DEC_FAILURE_CAUSE_V << AXI_IC_REG_DEC_FAILURE_CAUSE_S)
#define AXI_IC_REG_DEC_FAILURE_CAUSE_V  0x00000007U
#define AXI_IC_REG_DEC_FAILURE_CAUSE_S  3
/** AXI_IC_REG_DEC_FAILURE_MST_ID : RO; bitpos: [12:6]; default: 0;
 *  (master id, awid/arid)
 */
#define AXI_IC_REG_DEC_FAILURE_MST_ID    0x0000007FU
#define AXI_IC_REG_DEC_FAILURE_MST_ID_M  (AXI_IC_REG_DEC_FAILURE_MST_ID_V << AXI_IC_REG_DEC_FAILURE_MST_ID_S)
#define AXI_IC_REG_DEC_FAILURE_MST_ID_V  0x0000007FU
#define AXI_IC_REG_DEC_FAILURE_MST_ID_S  6

/** AXI_IC_QOS_DEBUG_MST_SEL_REG register
 *  Config the select for debug master.
 */
#define AXI_IC_QOS_DEBUG_MST_SEL_REG (DR_REG_AXI_IC_BASE + 0x24)
/** AXI_IC_REG_QOS_DEBUG_MST_SEL : R/W; bitpos: [3:0]; default: 0;
 *  select which master will be debug.
 */
#define AXI_IC_REG_QOS_DEBUG_MST_SEL    0x0000000FU
#define AXI_IC_REG_QOS_DEBUG_MST_SEL_M  (AXI_IC_REG_QOS_DEBUG_MST_SEL_V << AXI_IC_REG_QOS_DEBUG_MST_SEL_S)
#define AXI_IC_REG_QOS_DEBUG_MST_SEL_V  0x0000000FU
#define AXI_IC_REG_QOS_DEBUG_MST_SEL_S  0

/** AXI_IC_DEC_FAILURE_ADDR_REG register
 *  Record the address for AXI Master access Default slave.
 */
#define AXI_IC_DEC_FAILURE_ADDR_REG (DR_REG_AXI_IC_BASE + 0x80)
/** AXI_IC_REG_DEC_FAILURE_ADDR : RO; bitpos: [31:0]; default: 0;
 *  AXI IC core AW or AR channel decoder failure address.
 */
#define AXI_IC_REG_DEC_FAILURE_ADDR    0xFFFFFFFFU
#define AXI_IC_REG_DEC_FAILURE_ADDR_M  (AXI_IC_REG_DEC_FAILURE_ADDR_V << AXI_IC_REG_DEC_FAILURE_ADDR_S)
#define AXI_IC_REG_DEC_FAILURE_ADDR_V  0xFFFFFFFFU
#define AXI_IC_REG_DEC_FAILURE_ADDR_S  0

