espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_REG_SLAVE_IS_SECURE_REG register
 *  AXI IC core slave security control.
 */
#define AXI_IC_REG_SLAVE_IS_SECURE_REG (DR_REG_AXI_IC_BASE + 0x84)
/** AXI_IC_REG_SLAVE_IS_SECURE_0 : R/W; bitpos: [0]; default: 0;
 *  1 means safe and 0 means not safe.
 */
#define AXI_IC_REG_SLAVE_IS_SECURE_0    (BIT(0))
#define AXI_IC_REG_SLAVE_IS_SECURE_0_M  (AXI_IC_REG_SLAVE_IS_SECURE_0_V << AXI_IC_REG_SLAVE_IS_SECURE_0_S)
#define AXI_IC_REG_SLAVE_IS_SECURE_0_V  0x00000001U
#define AXI_IC_REG_SLAVE_IS_SECURE_0_S  0
/** AXI_IC_REG_SLAVE_IS_SECURE_1 : R/W; bitpos: [1]; default: 0;
 *  1 means safe and 0 means not safe.
 */
#define AXI_IC_REG_SLAVE_IS_SECURE_1    (BIT(1))
#define AXI_IC_REG_SLAVE_IS_SECURE_1_M  (AXI_IC_REG_SLAVE_IS_SECURE_1_V << AXI_IC_REG_SLAVE_IS_SECURE_1_S)
#define AXI_IC_REG_SLAVE_IS_SECURE_1_V  0x00000001U
#define AXI_IC_REG_SLAVE_IS_SECURE_1_S  1
/** AXI_IC_REG_SLAVE_IS_SECURE_2 : R/W; bitpos: [2]; default: 0;
 *  1 means safe and 0 means not safe.
 */
#define AXI_IC_REG_SLAVE_IS_SECURE_2    (BIT(2))
#define AXI_IC_REG_SLAVE_IS_SECURE_2_M  (AXI_IC_REG_SLAVE_IS_SECURE_2_V << AXI_IC_REG_SLAVE_IS_SECURE_2_S)
#define AXI_IC_REG_SLAVE_IS_SECURE_2_V  0x00000001U
#define AXI_IC_REG_SLAVE_IS_SECURE_2_S  2

/** AXI_IC_SLAVE_SECURITY_OVERRIDE_REG register
 *  The control signal whether slave security is overridden by software.
 */
#define AXI_IC_SLAVE_SECURITY_OVERRIDE_REG (DR_REG_AXI_IC_BASE + 0x88)
/** AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_0 : R/W; bitpos: [0]; default: 0;
 *  0 means not overridden, and 1 means overridden.
 */
#define AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_0    (BIT(0))
#define AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_0_M  (AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_0_V << AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_0_S)
#define AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_0_V  0x00000001U
#define AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_0_S  0
/** AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_1 : R/W; bitpos: [1]; default: 0;
 *  0 means not overridden, and 1 means overridden.
 */
#define AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_1    (BIT(1))
#define AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_1_M  (AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_1_V << AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_1_S)
#define AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_1_V  0x00000001U
#define AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_1_S  1
/** AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_2 : R/W; bitpos: [2]; default: 0;
 *  0 means not overridden, and 1 means overridden.
 */
#define AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_2    (BIT(2))
#define AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_2_M  (AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_2_V << AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_2_S)
#define AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_2_V  0x00000001U
#define AXI_IC_REG_SLAVE_SECURITY_OVERRIDE_2_S  2

/** AXI_IC_MASTER_IS_SECURE_REG register
 *  AXI IC core master security control.
 */
#define AXI_IC_MASTER_IS_SECURE_REG (DR_REG_AXI_IC_BASE + 0x8c)
/** AXI_IC_REG_MASTER_IS_SECURE_0 : R/W; bitpos: [0]; default: 0;
 *  1 means safe and 0 means not safe.
 */
#define AXI_IC_REG_MASTER_IS_SECURE_0    (BIT(0))
#define AXI_IC_REG_MASTER_IS_SECURE_0_M  (AXI_IC_REG_MASTER_IS_SECURE_0_V << AXI_IC_REG_MASTER_IS_SECURE_0_S)
#define AXI_IC_REG_MASTER_IS_SECURE_0_V  0x00000001U
#define AXI_IC_REG_MASTER_IS_SECURE_0_S  0
/** AXI_IC_REG_MASTER_IS_SECURE_1 : R/W; bitpos: [1]; default: 0;
 *  1 means safe and 0 means not safe.
 */
#define AXI_IC_REG_MASTER_IS_SECURE_1    (BIT(1))
#define AXI_IC_REG_MASTER_IS_SECURE_1_M  (AXI_IC_REG_MASTER_IS_SECURE_1_V << AXI_IC_REG_MASTER_IS_SECURE_1_S)
#define AXI_IC_REG_MASTER_IS_SECURE_1_V  0x00000001U
#define AXI_IC_REG_MASTER_IS_SECURE_1_S  1
/** AXI_IC_REG_MASTER_IS_SECURE_2 : R/W; bitpos: [2]; default: 0;
 *  1 means safe and 0 means not safe.
 */
#define AXI_IC_REG_MASTER_IS_SECURE_2    (BIT(2))
#define AXI_IC_REG_MASTER_IS_SECURE_2_M  (AXI_IC_REG_MASTER_IS_SECURE_2_V << AXI_IC_REG_MASTER_IS_SECURE_2_S)
#define AXI_IC_REG_MASTER_IS_SECURE_2_V  0x00000001U
#define AXI_IC_REG_MASTER_IS_SECURE_2_S  2
/** AXI_IC_REG_MASTER_IS_SECURE_3 : R/W; bitpos: [3]; default: 0;
 *  1 means safe and 0 means not safe.
 */
#define AXI_IC_REG_MASTER_IS_SECURE_3    (BIT(3))
#define AXI_IC_REG_MASTER_IS_SECURE_3_M  (AXI_IC_REG_MASTER_IS_SECURE_3_V << AXI_IC_REG_MASTER_IS_SECURE_3_S)
#define AXI_IC_REG_MASTER_IS_SECURE_3_V  0x00000001U
#define AXI_IC_REG_MASTER_IS_SECURE_3_S  3
/** AXI_IC_REG_MASTER_IS_SECURE_4 : R/W; bitpos: [4]; default: 0;
 *  1 means safe and 0 means not safe.
 */
#define AXI_IC_REG_MASTER_IS_SECURE_4    (BIT(4))
#define AXI_IC_REG_MASTER_IS_SECURE_4_M  (AXI_IC_REG_MASTER_IS_SECURE_4_V << AXI_IC_REG_MASTER_IS_SECURE_4_S)
#define AXI_IC_REG_MASTER_IS_SECURE_4_V  0x00000001U
#define AXI_IC_REG_MASTER_IS_SECURE_4_S  4
/** AXI_IC_REG_MASTER_IS_SECURE_5 : R/W; bitpos: [5]; default: 0;
 *  1 means safe and 0 means not safe.
 */
#define AXI_IC_REG_MASTER_IS_SECURE_5    (BIT(5))
#define AXI_IC_REG_MASTER_IS_SECURE_5_M  (AXI_IC_REG_MASTER_IS_SECURE_5_V << AXI_IC_REG_MASTER_IS_SECURE_5_S)
#define AXI_IC_REG_MASTER_IS_SECURE_5_V  0x00000001U
#define AXI_IC_REG_MASTER_IS_SECURE_5_S  5

/** AXI_IC_MASTER_SECURITY_OVERRIDE_REG register
 *  The control signal whether master security is overridden by software.
 */
#define AXI_IC_MASTER_SECURITY_OVERRIDE_REG (DR_REG_AXI_IC_BASE + 0x90)
/** AXI_IC_REG_MASTER_SECURITY_OVERRIDE_0 : R/W; bitpos: [0]; default: 0;
 *  0 means not overridden, and 1 means overridden.
 */
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_0    (BIT(0))
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_0_M  (AXI_IC_REG_MASTER_SECURITY_OVERRIDE_0_V << AXI_IC_REG_MASTER_SECURITY_OVERRIDE_0_S)
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_0_V  0x00000001U
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_0_S  0
/** AXI_IC_REG_MASTER_SECURITY_OVERRIDE_1 : R/W; bitpos: [1]; default: 0;
 *  0 means not overridden, and 1 means overridden.
 */
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_1    (BIT(1))
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_1_M  (AXI_IC_REG_MASTER_SECURITY_OVERRIDE_1_V << AXI_IC_REG_MASTER_SECURITY_OVERRIDE_1_S)
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_1_V  0x00000001U
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_1_S  1
/** AXI_IC_REG_MASTER_SECURITY_OVERRIDE_2 : R/W; bitpos: [2]; default: 0;
 *  0 means not overridden, and 1 means overridden.
 */
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_2    (BIT(2))
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_2_M  (AXI_IC_REG_MASTER_SECURITY_OVERRIDE_2_V << AXI_IC_REG_MASTER_SECURITY_OVERRIDE_2_S)
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_2_V  0x00000001U
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_2_S  2
/** AXI_IC_REG_MASTER_SECURITY_OVERRIDE_3 : R/W; bitpos: [3]; default: 0;
 *  0 means not overridden, and 1 means overridden.
 */
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_3    (BIT(3))
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_3_M  (AXI_IC_REG_MASTER_SECURITY_OVERRIDE_3_V << AXI_IC_REG_MASTER_SECURITY_OVERRIDE_3_S)
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_3_V  0x00000001U
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_3_S  3
/** AXI_IC_REG_MASTER_SECURITY_OVERRIDE_4 : R/W; bitpos: [4]; default: 0;
 *  0 means not overridden, and 1 means overridden.
 */
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_4    (BIT(4))
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_4_M  (AXI_IC_REG_MASTER_SECURITY_OVERRIDE_4_V << AXI_IC_REG_MASTER_SECURITY_OVERRIDE_4_S)
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_4_V  0x00000001U
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_4_S  4
/** AXI_IC_REG_MASTER_SECURITY_OVERRIDE_5 : R/W; bitpos: [5]; default: 0;
 *  0 means not overridden, and 1 means overridden.
 */
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_5    (BIT(5))
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_5_M  (AXI_IC_REG_MASTER_SECURITY_OVERRIDE_5_V << AXI_IC_REG_MASTER_SECURITY_OVERRIDE_5_S)
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_5_V  0x00000001U
#define AXI_IC_REG_MASTER_SECURITY_OVERRIDE_5_S  5

/** AXI_IC_AW_QOS_VALUE_0_REG register
 *  AXI IC core AW QOS value specified by software.
 */
#define AXI_IC_AW_QOS_VALUE_0_REG (DR_REG_AXI_IC_BASE + 0x94)
/** AXI_IC_REG_AW_QOS_VALUE_0 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core AW QOS value specified by software.
 */
#define AXI_IC_REG_AW_QOS_VALUE_0    0x0000000FU
#define AXI_IC_REG_AW_QOS_VALUE_0_M  (AXI_IC_REG_AW_QOS_VALUE_0_V << AXI_IC_REG_AW_QOS_VALUE_0_S)
#define AXI_IC_REG_AW_QOS_VALUE_0_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_VALUE_0_S  0

/** AXI_IC_AW_QOS_VALUE_1_REG register
 *  AXI IC core AW QOS value specified by software.
 */
#define AXI_IC_AW_QOS_VALUE_1_REG (DR_REG_AXI_IC_BASE + 0x98)
/** AXI_IC_REG_AW_QOS_VALUE_1 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core AW QOS value specified by software.
 */
#define AXI_IC_REG_AW_QOS_VALUE_1    0x0000000FU
#define AXI_IC_REG_AW_QOS_VALUE_1_M  (AXI_IC_REG_AW_QOS_VALUE_1_V << AXI_IC_REG_AW_QOS_VALUE_1_S)
#define AXI_IC_REG_AW_QOS_VALUE_1_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_VALUE_1_S  0

/** AXI_IC_AW_QOS_VALUE_2_REG register
 *  AXI IC core AW QOS value specified by software.
 */
#define AXI_IC_AW_QOS_VALUE_2_REG (DR_REG_AXI_IC_BASE + 0x9c)
/** AXI_IC_REG_AW_QOS_VALUE_2 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core AW QOS value specified by software.
 */
#define AXI_IC_REG_AW_QOS_VALUE_2    0x0000000FU
#define AXI_IC_REG_AW_QOS_VALUE_2_M  (AXI_IC_REG_AW_QOS_VALUE_2_V << AXI_IC_REG_AW_QOS_VALUE_2_S)
#define AXI_IC_REG_AW_QOS_VALUE_2_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_VALUE_2_S  0

