espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_AW_QOS_VALUE_3_REG register
 *  AXI IC core AW QOS value specified by software.
 */
#define AXI_IC_AW_QOS_VALUE_3_REG (DR_REG_AXI_IC_BASE + 0xa0)
/** AXI_IC_REG_AW_QOS_VALUE_3 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core AW QOS value specified by software.
 */
#define AXI_IC_REG_AW_QOS_VALUE_3    0x0000000FU
#define AXI_IC_REG_AW_QOS_VALUE_3_M  (AXI_IC_REG_AW_QOS_VALUE_3_V << AXI_IC_REG_AW_QOS_VALUE_3_S)
#define AXI_IC_REG_AW_QOS_VALUE_3_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_VALUE_3_S  0

/** AXI_IC_AW_QOS_VALUE_4_REG register
 *  AXI IC core AW QOS value specified by software.
 */
#define AXI_IC_AW_QOS_VALUE_4_REG (DR_REG_AXI_IC_BASE + 0xa4)
/** AXI_IC_REG_AW_QOS_VALUE_4 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core AW QOS value specified by software.
 */
#define AXI_IC_REG_AW_QOS_VALUE_4    0x0000000FU
#define AXI_IC_REG_AW_QOS_VALUE_4_M  (AXI_IC_REG_AW_QOS_VALUE_4_V << AXI_IC_REG_AW_QOS_VALUE_4_S)
#define AXI_IC_REG_AW_QOS_VALUE_4_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_VALUE_4_S  0

/** AXI_IC_AW_QOS_VALUE_5_REG register
 *  AXI IC core AW QOS value specified by software.
 */
#define AXI_IC_AW_QOS_VALUE_5_REG (DR_REG_AXI_IC_BASE + 0xa8)
/** AXI_IC_REG_AW_QOS_VALUE_5 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core AW QOS value specified by software.
 */
#define AXI_IC_REG_AW_QOS_VALUE_5    0x0000000FU
#define AXI_IC_REG_AW_QOS_VALUE_5_M  (AXI_IC_REG_AW_QOS_VALUE_5_V << AXI_IC_REG_AW_QOS_VALUE_5_S)
#define AXI_IC_REG_AW_QOS_VALUE_5_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_VALUE_5_S  0

/** AXI_IC_AR_QOS_VALUE_0_REG register
 *  AXI IC core AR QOS value specified by software.
 */
#define AXI_IC_AR_QOS_VALUE_0_REG (DR_REG_AXI_IC_BASE + 0xac)
/** AXI_IC_REG_AR_QOS_VALUE_0 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core AR QOS value specified by software.
 */
#define AXI_IC_REG_AR_QOS_VALUE_0    0x0000000FU
#define AXI_IC_REG_AR_QOS_VALUE_0_M  (AXI_IC_REG_AR_QOS_VALUE_0_V << AXI_IC_REG_AR_QOS_VALUE_0_S)
#define AXI_IC_REG_AR_QOS_VALUE_0_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_VALUE_0_S  0

/** AXI_IC_AR_QOS_VALUE_1_REG register
 *  AXI IC core AR QOS value specified by software.
 */
#define AXI_IC_AR_QOS_VALUE_1_REG (DR_REG_AXI_IC_BASE + 0xb0)
/** AXI_IC_REG_AR_QOS_VALUE_1 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core AR QOS value specified by software.
 */
#define AXI_IC_REG_AR_QOS_VALUE_1    0x0000000FU
#define AXI_IC_REG_AR_QOS_VALUE_1_M  (AXI_IC_REG_AR_QOS_VALUE_1_V << AXI_IC_REG_AR_QOS_VALUE_1_S)
#define AXI_IC_REG_AR_QOS_VALUE_1_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_VALUE_1_S  0

/** AXI_IC_AR_QOS_VALUE_2_REG register
 *  AXI IC core AR QOS value specified by software.
 */
#define AXI_IC_AR_QOS_VALUE_2_REG (DR_REG_AXI_IC_BASE + 0xb4)
/** AXI_IC_REG_AR_QOS_VALUE_2 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core AR QOS value specified by software.
 */
#define AXI_IC_REG_AR_QOS_VALUE_2    0x0000000FU
#define AXI_IC_REG_AR_QOS_VALUE_2_M  (AXI_IC_REG_AR_QOS_VALUE_2_V << AXI_IC_REG_AR_QOS_VALUE_2_S)
#define AXI_IC_REG_AR_QOS_VALUE_2_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_VALUE_2_S  0

/** AXI_IC_AR_QOS_VALUE_3_REG register
 *  AXI IC core AR QOS value specified by software.
 */
#define AXI_IC_AR_QOS_VALUE_3_REG (DR_REG_AXI_IC_BASE + 0xb8)
/** AXI_IC_REG_AR_QOS_VALUE_3 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core AR QOS value specified by software.
 */
#define AXI_IC_REG_AR_QOS_VALUE_3    0x0000000FU
#define AXI_IC_REG_AR_QOS_VALUE_3_M  (AXI_IC_REG_AR_QOS_VALUE_3_V << AXI_IC_REG_AR_QOS_VALUE_3_S)
#define AXI_IC_REG_AR_QOS_VALUE_3_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_VALUE_3_S  0

/** AXI_IC_AR_QOS_VALUE_4_REG register
 *  AXI IC core AR QOS value specified by software.
 */
#define AXI_IC_AR_QOS_VALUE_4_REG (DR_REG_AXI_IC_BASE + 0xbc)
/** AXI_IC_REG_AR_QOS_VALUE_4 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core AR QOS value specified by software.
 */
#define AXI_IC_REG_AR_QOS_VALUE_4    0x0000000FU
#define AXI_IC_REG_AR_QOS_VALUE_4_M  (AXI_IC_REG_AR_QOS_VALUE_4_V << AXI_IC_REG_AR_QOS_VALUE_4_S)
#define AXI_IC_REG_AR_QOS_VALUE_4_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_VALUE_4_S  0

/** AXI_IC_AR_QOS_VALUE_5_REG register
 *  AXI IC core AR QOS value specified by software.
 */
#define AXI_IC_AR_QOS_VALUE_5_REG (DR_REG_AXI_IC_BASE + 0xc0)
/** AXI_IC_REG_AR_QOS_VALUE_5 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core AR QOS value specified by software.
 */
#define AXI_IC_REG_AR_QOS_VALUE_5    0x0000000FU
#define AXI_IC_REG_AR_QOS_VALUE_5_M  (AXI_IC_REG_AR_QOS_VALUE_5_V << AXI_IC_REG_AR_QOS_VALUE_5_S)
#define AXI_IC_REG_AR_QOS_VALUE_5_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_VALUE_5_S  0

/** AXI_IC_B_PRIOR_VALUE_0_REG register
 *  AXI IC core B priority value specified by software.
 */
#define AXI_IC_B_PRIOR_VALUE_0_REG (DR_REG_AXI_IC_BASE + 0xc4)
/** AXI_IC_REG_B_PRIOR_VALUE_0 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core B priority value specified by software.
 */
#define AXI_IC_REG_B_PRIOR_VALUE_0    0x0000000FU
#define AXI_IC_REG_B_PRIOR_VALUE_0_M  (AXI_IC_REG_B_PRIOR_VALUE_0_V << AXI_IC_REG_B_PRIOR_VALUE_0_S)
#define AXI_IC_REG_B_PRIOR_VALUE_0_V  0x0000000FU
#define AXI_IC_REG_B_PRIOR_VALUE_0_S  0

/** AXI_IC_B_PRIOR_VALUE_1_REG register
 *  AXI IC core B priority value specified by software.
 */
#define AXI_IC_B_PRIOR_VALUE_1_REG (DR_REG_AXI_IC_BASE + 0xc8)
/** AXI_IC_REG_B_PRIOR_VALUE_1 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core B priority value specified by software.
 */
#define AXI_IC_REG_B_PRIOR_VALUE_1    0x0000000FU
#define AXI_IC_REG_B_PRIOR_VALUE_1_M  (AXI_IC_REG_B_PRIOR_VALUE_1_V << AXI_IC_REG_B_PRIOR_VALUE_1_S)
#define AXI_IC_REG_B_PRIOR_VALUE_1_V  0x0000000FU
#define AXI_IC_REG_B_PRIOR_VALUE_1_S  0

/** AXI_IC_B_PRIOR_VALUE_2_REG register
 *  AXI IC core B priority value specified by software.
 */
#define AXI_IC_B_PRIOR_VALUE_2_REG (DR_REG_AXI_IC_BASE + 0xcc)
/** AXI_IC_REG_B_PRIOR_VALUE_2 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core B priority value specified by software.
 */
#define AXI_IC_REG_B_PRIOR_VALUE_2    0x0000000FU
#define AXI_IC_REG_B_PRIOR_VALUE_2_M  (AXI_IC_REG_B_PRIOR_VALUE_2_V << AXI_IC_REG_B_PRIOR_VALUE_2_S)
#define AXI_IC_REG_B_PRIOR_VALUE_2_V  0x0000000FU
#define AXI_IC_REG_B_PRIOR_VALUE_2_S  0

/** AXI_IC_R_PRIOR_VALUE_0_REG register
 *  AXI IC core R priority value specified by software.
 */
#define AXI_IC_R_PRIOR_VALUE_0_REG (DR_REG_AXI_IC_BASE + 0xd0)
/** AXI_IC_REG_R_PRIOR_VALUE_0 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core R priority value specified by software.
 */
#define AXI_IC_REG_R_PRIOR_VALUE_0    0x0000000FU
#define AXI_IC_REG_R_PRIOR_VALUE_0_M  (AXI_IC_REG_R_PRIOR_VALUE_0_V << AXI_IC_REG_R_PRIOR_VALUE_0_S)
#define AXI_IC_REG_R_PRIOR_VALUE_0_V  0x0000000FU
#define AXI_IC_REG_R_PRIOR_VALUE_0_S  0

