espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_R_PRIOR_VALUE_1_REG register
 *  AXI IC core R priority value specified by software.
 */
#define AXI_IC_R_PRIOR_VALUE_1_REG (DR_REG_AXI_IC_BASE + 0xd4)
/** AXI_IC_REG_R_PRIOR_VALUE_1 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core R priority value specified by software.
 */
#define AXI_IC_REG_R_PRIOR_VALUE_1    0x0000000FU
#define AXI_IC_REG_R_PRIOR_VALUE_1_M  (AXI_IC_REG_R_PRIOR_VALUE_1_V << AXI_IC_REG_R_PRIOR_VALUE_1_S)
#define AXI_IC_REG_R_PRIOR_VALUE_1_V  0x0000000FU
#define AXI_IC_REG_R_PRIOR_VALUE_1_S  0

/** AXI_IC_R_PRIOR_VALUE_2_REG register
 *  AXI IC core R priority value specified by software.
 */
#define AXI_IC_R_PRIOR_VALUE_2_REG (DR_REG_AXI_IC_BASE + 0xd8)
/** AXI_IC_REG_R_PRIOR_VALUE_2 : R/W; bitpos: [3:0]; default: 0;
 *  AXI IC core R priority value specified by software.
 */
#define AXI_IC_REG_R_PRIOR_VALUE_2    0x0000000FU
#define AXI_IC_REG_R_PRIOR_VALUE_2_M  (AXI_IC_REG_R_PRIOR_VALUE_2_V << AXI_IC_REG_R_PRIOR_VALUE_2_S)
#define AXI_IC_REG_R_PRIOR_VALUE_2_V  0x0000000FU
#define AXI_IC_REG_R_PRIOR_VALUE_2_S  0

/** AXI_IC_AW_QOS_SEL_0_REG register
 *  AXI IC core AW QOS select signal specified by software.
 */
#define AXI_IC_AW_QOS_SEL_0_REG (DR_REG_AXI_IC_BASE + 0xdc)
/** AXI_IC_REG_AW_QOS_SEL_0 : R/W; bitpos: [1:0]; default: 0;
 *  2'b00 selects the original QOS value, 2'b01 selects the QOS value set by the
 *  software, 2'b10 selects the QOS value set by the QOS regulator.
 */
#define AXI_IC_REG_AW_QOS_SEL_0    0x00000003U
#define AXI_IC_REG_AW_QOS_SEL_0_M  (AXI_IC_REG_AW_QOS_SEL_0_V << AXI_IC_REG_AW_QOS_SEL_0_S)
#define AXI_IC_REG_AW_QOS_SEL_0_V  0x00000003U
#define AXI_IC_REG_AW_QOS_SEL_0_S  0

/** AXI_IC_AW_QOS_SEL_1_REG register
 *  AXI IC core AW QOS select signal specified by software.
 */
#define AXI_IC_AW_QOS_SEL_1_REG (DR_REG_AXI_IC_BASE + 0xe0)
/** AXI_IC_REG_AW_QOS_SEL_1 : R/W; bitpos: [1:0]; default: 0;
 *  2'b00 selects the original QOS value, 2'b01 selects the QOS value set by the
 *  software, 2'b10 selects the QOS value set by the QOS regulator.
 */
#define AXI_IC_REG_AW_QOS_SEL_1    0x00000003U
#define AXI_IC_REG_AW_QOS_SEL_1_M  (AXI_IC_REG_AW_QOS_SEL_1_V << AXI_IC_REG_AW_QOS_SEL_1_S)
#define AXI_IC_REG_AW_QOS_SEL_1_V  0x00000003U
#define AXI_IC_REG_AW_QOS_SEL_1_S  0

/** AXI_IC_AW_QOS_SEL_2_REG register
 *  AXI IC core AW QOS select signal specified by software.
 */
#define AXI_IC_AW_QOS_SEL_2_REG (DR_REG_AXI_IC_BASE + 0xe4)
/** AXI_IC_REG_AW_QOS_SEL_2 : R/W; bitpos: [1:0]; default: 0;
 *  2'b00 selects the original QOS value, 2'b01 selects the QOS value set by the
 *  software, 2'b10 selects the QOS value set by the QOS regulator.
 */
#define AXI_IC_REG_AW_QOS_SEL_2    0x00000003U
#define AXI_IC_REG_AW_QOS_SEL_2_M  (AXI_IC_REG_AW_QOS_SEL_2_V << AXI_IC_REG_AW_QOS_SEL_2_S)
#define AXI_IC_REG_AW_QOS_SEL_2_V  0x00000003U
#define AXI_IC_REG_AW_QOS_SEL_2_S  0

/** AXI_IC_AW_QOS_SEL_3_REG register
 *  AXI IC core AW QOS select signal specified by software.
 */
#define AXI_IC_AW_QOS_SEL_3_REG (DR_REG_AXI_IC_BASE + 0xe8)
/** AXI_IC_REG_AW_QOS_SEL_3 : R/W; bitpos: [1:0]; default: 0;
 *  2'b00 selects the original QOS value, 2'b01 selects the QOS value set by the
 *  software, 2'b10 selects the QOS value set by the QOS regulator.
 */
#define AXI_IC_REG_AW_QOS_SEL_3    0x00000003U
#define AXI_IC_REG_AW_QOS_SEL_3_M  (AXI_IC_REG_AW_QOS_SEL_3_V << AXI_IC_REG_AW_QOS_SEL_3_S)
#define AXI_IC_REG_AW_QOS_SEL_3_V  0x00000003U
#define AXI_IC_REG_AW_QOS_SEL_3_S  0

/** AXI_IC_AW_QOS_SEL_4_REG register
 *  AXI IC core AW QOS select signal specified by software.
 */
#define AXI_IC_AW_QOS_SEL_4_REG (DR_REG_AXI_IC_BASE + 0xec)
/** AXI_IC_REG_AW_QOS_SEL_4 : R/W; bitpos: [1:0]; default: 0;
 *  2'b00 selects the original QOS value, 2'b01 selects the QOS value set by the
 *  software, 2'b10 selects the QOS value set by the QOS regulator.
 */
#define AXI_IC_REG_AW_QOS_SEL_4    0x00000003U
#define AXI_IC_REG_AW_QOS_SEL_4_M  (AXI_IC_REG_AW_QOS_SEL_4_V << AXI_IC_REG_AW_QOS_SEL_4_S)
#define AXI_IC_REG_AW_QOS_SEL_4_V  0x00000003U
#define AXI_IC_REG_AW_QOS_SEL_4_S  0

/** AXI_IC_AW_QOS_SEL_5_REG register
 *  AXI IC core AW QOS select signal specified by software.
 */
#define AXI_IC_AW_QOS_SEL_5_REG (DR_REG_AXI_IC_BASE + 0xf0)
/** AXI_IC_REG_AW_QOS_SEL_5 : R/W; bitpos: [1:0]; default: 0;
 *  2'b00 selects the original QOS value, 2'b01 selects the QOS value set by the
 *  software, 2'b10 selects the QOS value set by the QOS regulator.
 */
#define AXI_IC_REG_AW_QOS_SEL_5    0x00000003U
#define AXI_IC_REG_AW_QOS_SEL_5_M  (AXI_IC_REG_AW_QOS_SEL_5_V << AXI_IC_REG_AW_QOS_SEL_5_S)
#define AXI_IC_REG_AW_QOS_SEL_5_V  0x00000003U
#define AXI_IC_REG_AW_QOS_SEL_5_S  0

/** AXI_IC_AR_QOS_SEL_0_REG register
 *  AXI IC core AR QOS select signal specified by software.
 */
#define AXI_IC_AR_QOS_SEL_0_REG (DR_REG_AXI_IC_BASE + 0xf4)
/** AXI_IC_REG_AR_QOS_SEL_0 : R/W; bitpos: [1:0]; default: 0;
 *  2'b00 selects the original QOS value, 2'b01 selects the QOS value set by the
 *  software, 2'b10 selects the QOS value set by the QOS regulator.
 */
#define AXI_IC_REG_AR_QOS_SEL_0    0x00000003U
#define AXI_IC_REG_AR_QOS_SEL_0_M  (AXI_IC_REG_AR_QOS_SEL_0_V << AXI_IC_REG_AR_QOS_SEL_0_S)
#define AXI_IC_REG_AR_QOS_SEL_0_V  0x00000003U
#define AXI_IC_REG_AR_QOS_SEL_0_S  0

/** AXI_IC_AR_QOS_SEL_1_REG register
 *  AXI IC core AR QOS select signal specified by software.
 */
#define AXI_IC_AR_QOS_SEL_1_REG (DR_REG_AXI_IC_BASE + 0xf8)
/** AXI_IC_REG_AR_QOS_SEL_1 : R/W; bitpos: [1:0]; default: 0;
 *  2'b00 selects the original QOS value, 2'b01 selects the QOS value set by the
 *  software, 2'b10 selects the QOS value set by the QOS regulator.
 */
#define AXI_IC_REG_AR_QOS_SEL_1    0x00000003U
#define AXI_IC_REG_AR_QOS_SEL_1_M  (AXI_IC_REG_AR_QOS_SEL_1_V << AXI_IC_REG_AR_QOS_SEL_1_S)
#define AXI_IC_REG_AR_QOS_SEL_1_V  0x00000003U
#define AXI_IC_REG_AR_QOS_SEL_1_S  0

/** AXI_IC_AR_QOS_SEL_2_REG register
 *  AXI IC core AR QOS select signal specified by software.
 */
#define AXI_IC_AR_QOS_SEL_2_REG (DR_REG_AXI_IC_BASE + 0xfc)
/** AXI_IC_REG_AR_QOS_SEL_2 : R/W; bitpos: [1:0]; default: 0;
 *  2'b00 selects the original QOS value, 2'b01 selects the QOS value set by the
 *  software, 2'b10 selects the QOS value set by the QOS regulator.
 */
#define AXI_IC_REG_AR_QOS_SEL_2    0x00000003U
#define AXI_IC_REG_AR_QOS_SEL_2_M  (AXI_IC_REG_AR_QOS_SEL_2_V << AXI_IC_REG_AR_QOS_SEL_2_S)
#define AXI_IC_REG_AR_QOS_SEL_2_V  0x00000003U
#define AXI_IC_REG_AR_QOS_SEL_2_S  0

/** AXI_IC_AR_QOS_SEL_3_REG register
 *  AXI IC core AR QOS select signal specified by software.
 */
#define AXI_IC_AR_QOS_SEL_3_REG (DR_REG_AXI_IC_BASE + 0x100)
/** AXI_IC_REG_AR_QOS_SEL_3 : R/W; bitpos: [1:0]; default: 0;
 *  2'b00 selects the original QOS value, 2'b01 selects the QOS value set by the
 *  software, 2'b10 selects the QOS value set by the QOS regulator.
 */
#define AXI_IC_REG_AR_QOS_SEL_3    0x00000003U
#define AXI_IC_REG_AR_QOS_SEL_3_M  (AXI_IC_REG_AR_QOS_SEL_3_V << AXI_IC_REG_AR_QOS_SEL_3_S)
#define AXI_IC_REG_AR_QOS_SEL_3_V  0x00000003U
#define AXI_IC_REG_AR_QOS_SEL_3_S  0

/** AXI_IC_AR_QOS_SEL_4_REG register
 *  AXI IC core AR QOS select signal specified by software.
 */
#define AXI_IC_AR_QOS_SEL_4_REG (DR_REG_AXI_IC_BASE + 0x104)
/** AXI_IC_REG_AR_QOS_SEL_4 : R/W; bitpos: [1:0]; default: 0;
 *  2'b00 selects the original QOS value, 2'b01 selects the QOS value set by the
 *  software, 2'b10 selects the QOS value set by the QOS regulator.
 */
#define AXI_IC_REG_AR_QOS_SEL_4    0x00000003U
#define AXI_IC_REG_AR_QOS_SEL_4_M  (AXI_IC_REG_AR_QOS_SEL_4_V << AXI_IC_REG_AR_QOS_SEL_4_S)
#define AXI_IC_REG_AR_QOS_SEL_4_V  0x00000003U
#define AXI_IC_REG_AR_QOS_SEL_4_S  0

/** AXI_IC_AR_QOS_SEL_5_REG register
 *  AXI IC core AR QOS select signal specified by software.
 */
#define AXI_IC_AR_QOS_SEL_5_REG (DR_REG_AXI_IC_BASE + 0x108)
/** AXI_IC_REG_AR_QOS_SEL_5 : R/W; bitpos: [1:0]; default: 0;
 *  2'b00 selects the original QOS value, 2'b01 selects the QOS value set by the
 *  software, 2'b10 selects the QOS value set by the QOS regulator.
 */
#define AXI_IC_REG_AR_QOS_SEL_5    0x00000003U
#define AXI_IC_REG_AR_QOS_SEL_5_M  (AXI_IC_REG_AR_QOS_SEL_5_V << AXI_IC_REG_AR_QOS_SEL_5_S)
#define AXI_IC_REG_AR_QOS_SEL_5_V  0x00000003U
#define AXI_IC_REG_AR_QOS_SEL_5_S  0

/** AXI_IC_AW_QOS_RECOVERY_REG register
 *  AXI IC core AW QOS recovery signal specified by software.
 */
#define AXI_IC_AW_QOS_RECOVERY_REG (DR_REG_AXI_IC_BASE + 0x10c)
/** AXI_IC_REG_AW_QOS_RECOVERY_0 : R/W; bitpos: [0]; default: 0;
 *  Use QOS_COPY in SI_IF AW payload when it is asserted, otherwise use QOS_NEW (from
 *  QOS regulator or software).
 */
#define AXI_IC_REG_AW_QOS_RECOVERY_0    (BIT(0))
#define AXI_IC_REG_AW_QOS_RECOVERY_0_M  (AXI_IC_REG_AW_QOS_RECOVERY_0_V << AXI_IC_REG_AW_QOS_RECOVERY_0_S)
#define AXI_IC_REG_AW_QOS_RECOVERY_0_V  0x00000001U
#define AXI_IC_REG_AW_QOS_RECOVERY_0_S  0
/** AXI_IC_REG_AW_QOS_RECOVERY_1 : R/W; bitpos: [1]; default: 0;
 *  Use QOS_COPY in SI_IF AW payload when it is asserted, otherwise use QOS_NEW (from
 *  QOS regulator or software).
 */
#define AXI_IC_REG_AW_QOS_RECOVERY_1    (BIT(1))
#define AXI_IC_REG_AW_QOS_RECOVERY_1_M  (AXI_IC_REG_AW_QOS_RECOVERY_1_V << AXI_IC_REG_AW_QOS_RECOVERY_1_S)
#define AXI_IC_REG_AW_QOS_RECOVERY_1_V  0x00000001U
#define AXI_IC_REG_AW_QOS_RECOVERY_1_S  1
/** AXI_IC_REG_AW_QOS_RECOVERY_2 : R/W; bitpos: [2]; default: 0;
 *  Use QOS_COPY in SI_IF AW payload when it is asserted, otherwise use QOS_NEW (from
 *  QOS regulator or software).
 */
#define AXI_IC_REG_AW_QOS_RECOVERY_2    (BIT(2))
#define AXI_IC_REG_AW_QOS_RECOVERY_2_M  (AXI_IC_REG_AW_QOS_RECOVERY_2_V << AXI_IC_REG_AW_QOS_RECOVERY_2_S)
#define AXI_IC_REG_AW_QOS_RECOVERY_2_V  0x00000001U
#define AXI_IC_REG_AW_QOS_RECOVERY_2_S  2

/** AXI_IC_AR_QOS_RECOVERY_REG register
 *  AXI IC core AR QOS recovery signal specified by software.
 */
#define AXI_IC_AR_QOS_RECOVERY_REG (DR_REG_AXI_IC_BASE + 0x110)
/** AXI_IC_REG_AR_QOS_RECOVERY_0 : R/W; bitpos: [0]; default: 0;
 *  Use QOS_COPY in SI_IF AR payload when it is asserted, otherwise use QOS_NEW (from
 *  QOS regulator or software).
 */
#define AXI_IC_REG_AR_QOS_RECOVERY_0    (BIT(0))
#define AXI_IC_REG_AR_QOS_RECOVERY_0_M  (AXI_IC_REG_AR_QOS_RECOVERY_0_V << AXI_IC_REG_AR_QOS_RECOVERY_0_S)
#define AXI_IC_REG_AR_QOS_RECOVERY_0_V  0x00000001U
#define AXI_IC_REG_AR_QOS_RECOVERY_0_S  0
/** AXI_IC_REG_AR_QOS_RECOVERY_1 : R/W; bitpos: [1]; default: 0;
 *  Use QOS_COPY in SI_IF AR payload when it is asserted, otherwise use QOS_NEW (from
 *  QOS regulator or software).
 */
#define AXI_IC_REG_AR_QOS_RECOVERY_1    (BIT(1))
#define AXI_IC_REG_AR_QOS_RECOVERY_1_M  (AXI_IC_REG_AR_QOS_RECOVERY_1_V << AXI_IC_REG_AR_QOS_RECOVERY_1_S)
#define AXI_IC_REG_AR_QOS_RECOVERY_1_V  0x00000001U
#define AXI_IC_REG_AR_QOS_RECOVERY_1_S  1
/** AXI_IC_REG_AR_QOS_RECOVERY_2 : R/W; bitpos: [2]; default: 0;
 *  Use QOS_COPY in SI_IF AR payload when it is asserted, otherwise use QOS_NEW (from
 *  QOS regulator or software).
 */
#define AXI_IC_REG_AR_QOS_RECOVERY_2    (BIT(2))
#define AXI_IC_REG_AR_QOS_RECOVERY_2_M  (AXI_IC_REG_AR_QOS_RECOVERY_2_V << AXI_IC_REG_AR_QOS_RECOVERY_2_S)
#define AXI_IC_REG_AR_QOS_RECOVERY_2_V  0x00000001U
#define AXI_IC_REG_AR_QOS_RECOVERY_2_S  2

/** AXI_IC_AW_QOS_ID_MASK_0_REG register
 *  Config the aw channel id mask for id filter function.
 */
#define AXI_IC_AW_QOS_ID_MASK_0_REG (DR_REG_AXI_IC_BASE + 0x114)
/** AXI_IC_REG_AW_QOS_ID_MASK_0 : R/W; bitpos: [3:0]; default: 15;
 *  mask for enable qos of aw channel id.
 */
#define AXI_IC_REG_AW_QOS_ID_MASK_0    0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_MASK_0_M  (AXI_IC_REG_AW_QOS_ID_MASK_0_V << AXI_IC_REG_AW_QOS_ID_MASK_0_S)
#define AXI_IC_REG_AW_QOS_ID_MASK_0_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_MASK_0_S  0

