espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_AW_QOS_ID_MASK_1_REG register
 *  Config the aw channel id mask for id filter function.
 */
#define AXI_IC_AW_QOS_ID_MASK_1_REG (DR_REG_AXI_IC_BASE + 0x118)
/** AXI_IC_REG_AW_QOS_ID_MASK_1 : R/W; bitpos: [3:0]; default: 15;
 *  mask for enable qos of aw channel id.
 */
#define AXI_IC_REG_AW_QOS_ID_MASK_1    0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_MASK_1_M  (AXI_IC_REG_AW_QOS_ID_MASK_1_V << AXI_IC_REG_AW_QOS_ID_MASK_1_S)
#define AXI_IC_REG_AW_QOS_ID_MASK_1_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_MASK_1_S  0

/** AXI_IC_AW_QOS_ID_MASK_2_REG register
 *  Config the aw channel id mask for id filter function.
 */
#define AXI_IC_AW_QOS_ID_MASK_2_REG (DR_REG_AXI_IC_BASE + 0x11c)
/** AXI_IC_REG_AW_QOS_ID_MASK_2 : R/W; bitpos: [3:0]; default: 15;
 *  mask for enable qos of aw channel id.
 */
#define AXI_IC_REG_AW_QOS_ID_MASK_2    0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_MASK_2_M  (AXI_IC_REG_AW_QOS_ID_MASK_2_V << AXI_IC_REG_AW_QOS_ID_MASK_2_S)
#define AXI_IC_REG_AW_QOS_ID_MASK_2_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_MASK_2_S  0

/** AXI_IC_AW_QOS_ID_MASK_3_REG register
 *  Config the aw channel id mask for id filter function.
 */
#define AXI_IC_AW_QOS_ID_MASK_3_REG (DR_REG_AXI_IC_BASE + 0x120)
/** AXI_IC_REG_AW_QOS_ID_MASK_3 : R/W; bitpos: [3:0]; default: 15;
 *  mask for enable qos of aw channel id.
 */
#define AXI_IC_REG_AW_QOS_ID_MASK_3    0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_MASK_3_M  (AXI_IC_REG_AW_QOS_ID_MASK_3_V << AXI_IC_REG_AW_QOS_ID_MASK_3_S)
#define AXI_IC_REG_AW_QOS_ID_MASK_3_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_MASK_3_S  0

/** AXI_IC_AW_QOS_ID_MASK_4_REG register
 *  Config the aw channel id mask for id filter function.
 */
#define AXI_IC_AW_QOS_ID_MASK_4_REG (DR_REG_AXI_IC_BASE + 0x124)
/** AXI_IC_REG_AW_QOS_ID_MASK_4 : R/W; bitpos: [3:0]; default: 15;
 *  mask for enable qos of aw channel id.
 */
#define AXI_IC_REG_AW_QOS_ID_MASK_4    0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_MASK_4_M  (AXI_IC_REG_AW_QOS_ID_MASK_4_V << AXI_IC_REG_AW_QOS_ID_MASK_4_S)
#define AXI_IC_REG_AW_QOS_ID_MASK_4_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_MASK_4_S  0

/** AXI_IC_AW_QOS_ID_MASK_5_REG register
 *  Config the aw channel id mask for id filter function.
 */
#define AXI_IC_AW_QOS_ID_MASK_5_REG (DR_REG_AXI_IC_BASE + 0x128)
/** AXI_IC_REG_AW_QOS_ID_MASK_5 : R/W; bitpos: [3:0]; default: 15;
 *  mask for enable qos of aw channel id.
 */
#define AXI_IC_REG_AW_QOS_ID_MASK_5    0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_MASK_5_M  (AXI_IC_REG_AW_QOS_ID_MASK_5_V << AXI_IC_REG_AW_QOS_ID_MASK_5_S)
#define AXI_IC_REG_AW_QOS_ID_MASK_5_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_MASK_5_S  0

/** AXI_IC_AR_QOS_ID_MASK_0_REG register
 *  Config the ar channel id mask for id filter function.
 */
#define AXI_IC_AR_QOS_ID_MASK_0_REG (DR_REG_AXI_IC_BASE + 0x12c)
/** AXI_IC_REG_AR_QOS_ID_MASK_0 : R/W; bitpos: [3:0]; default: 15;
 *  mask for enable qos of ar channel id.
 */
#define AXI_IC_REG_AR_QOS_ID_MASK_0    0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_MASK_0_M  (AXI_IC_REG_AR_QOS_ID_MASK_0_V << AXI_IC_REG_AR_QOS_ID_MASK_0_S)
#define AXI_IC_REG_AR_QOS_ID_MASK_0_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_MASK_0_S  0

/** AXI_IC_AR_QOS_ID_MASK_1_REG register
 *  Config the ar channel id mask for id filter function.
 */
#define AXI_IC_AR_QOS_ID_MASK_1_REG (DR_REG_AXI_IC_BASE + 0x130)
/** AXI_IC_REG_AR_QOS_ID_MASK_1 : R/W; bitpos: [3:0]; default: 15;
 *  mask for enable qos of ar channel id.
 */
#define AXI_IC_REG_AR_QOS_ID_MASK_1    0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_MASK_1_M  (AXI_IC_REG_AR_QOS_ID_MASK_1_V << AXI_IC_REG_AR_QOS_ID_MASK_1_S)
#define AXI_IC_REG_AR_QOS_ID_MASK_1_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_MASK_1_S  0

/** AXI_IC_AR_QOS_ID_MASK_2_REG register
 *  Config the ar channel id mask for id filter function.
 */
#define AXI_IC_AR_QOS_ID_MASK_2_REG (DR_REG_AXI_IC_BASE + 0x134)
/** AXI_IC_REG_AR_QOS_ID_MASK_2 : R/W; bitpos: [3:0]; default: 15;
 *  mask for enable qos of ar channel id.
 */
#define AXI_IC_REG_AR_QOS_ID_MASK_2    0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_MASK_2_M  (AXI_IC_REG_AR_QOS_ID_MASK_2_V << AXI_IC_REG_AR_QOS_ID_MASK_2_S)
#define AXI_IC_REG_AR_QOS_ID_MASK_2_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_MASK_2_S  0

/** AXI_IC_AR_QOS_ID_MASK_3_REG register
 *  Config the ar channel id mask for id filter function.
 */
#define AXI_IC_AR_QOS_ID_MASK_3_REG (DR_REG_AXI_IC_BASE + 0x138)
/** AXI_IC_REG_AR_QOS_ID_MASK_3 : R/W; bitpos: [3:0]; default: 15;
 *  mask for enable qos of ar channel id.
 */
#define AXI_IC_REG_AR_QOS_ID_MASK_3    0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_MASK_3_M  (AXI_IC_REG_AR_QOS_ID_MASK_3_V << AXI_IC_REG_AR_QOS_ID_MASK_3_S)
#define AXI_IC_REG_AR_QOS_ID_MASK_3_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_MASK_3_S  0

/** AXI_IC_AR_QOS_ID_MASK_4_REG register
 *  Config the ar channel id mask for id filter function.
 */
#define AXI_IC_AR_QOS_ID_MASK_4_REG (DR_REG_AXI_IC_BASE + 0x13c)
/** AXI_IC_REG_AR_QOS_ID_MASK_4 : R/W; bitpos: [3:0]; default: 15;
 *  mask for enable qos of ar channel id.
 */
#define AXI_IC_REG_AR_QOS_ID_MASK_4    0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_MASK_4_M  (AXI_IC_REG_AR_QOS_ID_MASK_4_V << AXI_IC_REG_AR_QOS_ID_MASK_4_S)
#define AXI_IC_REG_AR_QOS_ID_MASK_4_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_MASK_4_S  0

/** AXI_IC_AR_QOS_ID_MASK_5_REG register
 *  Config the ar channel id mask for id filter function.
 */
#define AXI_IC_AR_QOS_ID_MASK_5_REG (DR_REG_AXI_IC_BASE + 0x140)
/** AXI_IC_REG_AR_QOS_ID_MASK_5 : R/W; bitpos: [3:0]; default: 15;
 *  mask for enable qos of ar channel id.
 */
#define AXI_IC_REG_AR_QOS_ID_MASK_5    0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_MASK_5_M  (AXI_IC_REG_AR_QOS_ID_MASK_5_V << AXI_IC_REG_AR_QOS_ID_MASK_5_S)
#define AXI_IC_REG_AR_QOS_ID_MASK_5_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_MASK_5_S  0

/** AXI_IC_AW_QOS_ID_FILTER_0_REG register
 *  Config the aw channel id filter for id filter function.
 */
#define AXI_IC_AW_QOS_ID_FILTER_0_REG (DR_REG_AXI_IC_BASE + 0x144)
/** AXI_IC_REG_AW_QOS_ID_FILTER_0 : R/W; bitpos: [3:0]; default: 15;
 *  filter for enable qos of aw channel id.
 */
#define AXI_IC_REG_AW_QOS_ID_FILTER_0    0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_FILTER_0_M  (AXI_IC_REG_AW_QOS_ID_FILTER_0_V << AXI_IC_REG_AW_QOS_ID_FILTER_0_S)
#define AXI_IC_REG_AW_QOS_ID_FILTER_0_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_FILTER_0_S  0

