espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_AW_QOS_ID_FILTER_1_REG register
 *  Config the aw channel id filter for id filter function.
 */
#define AXI_IC_AW_QOS_ID_FILTER_1_REG (DR_REG_AXI_IC_BASE + 0x148)
/** AXI_IC_REG_AW_QOS_ID_FILTER_1 : R/W; bitpos: [3:0]; default: 15;
 *  filter for enable qos of aw channel id.
 */
#define AXI_IC_REG_AW_QOS_ID_FILTER_1    0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_FILTER_1_M  (AXI_IC_REG_AW_QOS_ID_FILTER_1_V << AXI_IC_REG_AW_QOS_ID_FILTER_1_S)
#define AXI_IC_REG_AW_QOS_ID_FILTER_1_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_FILTER_1_S  0

/** AXI_IC_AW_QOS_ID_FILTER_2_REG register
 *  Config the aw channel id filter for id filter function.
 */
#define AXI_IC_AW_QOS_ID_FILTER_2_REG (DR_REG_AXI_IC_BASE + 0x14c)
/** AXI_IC_REG_AW_QOS_ID_FILTER_2 : R/W; bitpos: [3:0]; default: 15;
 *  filter for enable qos of aw channel id.
 */
#define AXI_IC_REG_AW_QOS_ID_FILTER_2    0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_FILTER_2_M  (AXI_IC_REG_AW_QOS_ID_FILTER_2_V << AXI_IC_REG_AW_QOS_ID_FILTER_2_S)
#define AXI_IC_REG_AW_QOS_ID_FILTER_2_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_FILTER_2_S  0

/** AXI_IC_AW_QOS_ID_FILTER_3_REG register
 *  Config the aw channel id filter for id filter function.
 */
#define AXI_IC_AW_QOS_ID_FILTER_3_REG (DR_REG_AXI_IC_BASE + 0x150)
/** AXI_IC_REG_AW_QOS_ID_FILTER_3 : R/W; bitpos: [3:0]; default: 15;
 *  filter for enable qos of aw channel id.
 */
#define AXI_IC_REG_AW_QOS_ID_FILTER_3    0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_FILTER_3_M  (AXI_IC_REG_AW_QOS_ID_FILTER_3_V << AXI_IC_REG_AW_QOS_ID_FILTER_3_S)
#define AXI_IC_REG_AW_QOS_ID_FILTER_3_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_FILTER_3_S  0

/** AXI_IC_AW_QOS_ID_FILTER_4_REG register
 *  Config the aw channel id filter for id filter function.
 */
#define AXI_IC_AW_QOS_ID_FILTER_4_REG (DR_REG_AXI_IC_BASE + 0x154)
/** AXI_IC_REG_AW_QOS_ID_FILTER_4 : R/W; bitpos: [3:0]; default: 15;
 *  filter for enable qos of aw channel id.
 */
#define AXI_IC_REG_AW_QOS_ID_FILTER_4    0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_FILTER_4_M  (AXI_IC_REG_AW_QOS_ID_FILTER_4_V << AXI_IC_REG_AW_QOS_ID_FILTER_4_S)
#define AXI_IC_REG_AW_QOS_ID_FILTER_4_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_FILTER_4_S  0

/** AXI_IC_AW_QOS_ID_FILTER_5_REG register
 *  Config the aw channel id filter for id filter function.
 */
#define AXI_IC_AW_QOS_ID_FILTER_5_REG (DR_REG_AXI_IC_BASE + 0x158)
/** AXI_IC_REG_AW_QOS_ID_FILTER_5 : R/W; bitpos: [3:0]; default: 15;
 *  filter for enable qos of aw channel id.
 */
#define AXI_IC_REG_AW_QOS_ID_FILTER_5    0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_FILTER_5_M  (AXI_IC_REG_AW_QOS_ID_FILTER_5_V << AXI_IC_REG_AW_QOS_ID_FILTER_5_S)
#define AXI_IC_REG_AW_QOS_ID_FILTER_5_V  0x0000000FU
#define AXI_IC_REG_AW_QOS_ID_FILTER_5_S  0

/** AXI_IC_AR_QOS_ID_FILTER_0_REG register
 *  Config the ar channel id filter for id filter function.
 */
#define AXI_IC_AR_QOS_ID_FILTER_0_REG (DR_REG_AXI_IC_BASE + 0x15c)
/** AXI_IC_REG_AR_QOS_ID_FILTER_0 : R/W; bitpos: [3:0]; default: 15;
 *  filter for enable qos of ar channel id.
 */
#define AXI_IC_REG_AR_QOS_ID_FILTER_0    0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_FILTER_0_M  (AXI_IC_REG_AR_QOS_ID_FILTER_0_V << AXI_IC_REG_AR_QOS_ID_FILTER_0_S)
#define AXI_IC_REG_AR_QOS_ID_FILTER_0_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_FILTER_0_S  0

/** AXI_IC_AR_QOS_ID_FILTER_1_REG register
 *  Config the ar channel id filter for id filter function.
 */
#define AXI_IC_AR_QOS_ID_FILTER_1_REG (DR_REG_AXI_IC_BASE + 0x160)
/** AXI_IC_REG_AR_QOS_ID_FILTER_1 : R/W; bitpos: [3:0]; default: 15;
 *  filter for enable qos of ar channel id.
 */
#define AXI_IC_REG_AR_QOS_ID_FILTER_1    0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_FILTER_1_M  (AXI_IC_REG_AR_QOS_ID_FILTER_1_V << AXI_IC_REG_AR_QOS_ID_FILTER_1_S)
#define AXI_IC_REG_AR_QOS_ID_FILTER_1_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_FILTER_1_S  0

/** AXI_IC_AR_QOS_ID_FILTER_2_REG register
 *  Config the ar channel id filter for id filter function.
 */
#define AXI_IC_AR_QOS_ID_FILTER_2_REG (DR_REG_AXI_IC_BASE + 0x164)
/** AXI_IC_REG_AR_QOS_ID_FILTER_2 : R/W; bitpos: [3:0]; default: 15;
 *  filter for enable qos of ar channel id.
 */
#define AXI_IC_REG_AR_QOS_ID_FILTER_2    0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_FILTER_2_M  (AXI_IC_REG_AR_QOS_ID_FILTER_2_V << AXI_IC_REG_AR_QOS_ID_FILTER_2_S)
#define AXI_IC_REG_AR_QOS_ID_FILTER_2_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_FILTER_2_S  0

/** AXI_IC_AR_QOS_ID_FILTER_3_REG register
 *  Config the ar channel id filter for id filter function.
 */
#define AXI_IC_AR_QOS_ID_FILTER_3_REG (DR_REG_AXI_IC_BASE + 0x168)
/** AXI_IC_REG_AR_QOS_ID_FILTER_3 : R/W; bitpos: [3:0]; default: 15;
 *  filter for enable qos of ar channel id.
 */
#define AXI_IC_REG_AR_QOS_ID_FILTER_3    0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_FILTER_3_M  (AXI_IC_REG_AR_QOS_ID_FILTER_3_V << AXI_IC_REG_AR_QOS_ID_FILTER_3_S)
#define AXI_IC_REG_AR_QOS_ID_FILTER_3_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_FILTER_3_S  0

/** AXI_IC_AR_QOS_ID_FILTER_4_REG register
 *  Config the ar channel id filter for id filter function.
 */
#define AXI_IC_AR_QOS_ID_FILTER_4_REG (DR_REG_AXI_IC_BASE + 0x16c)
/** AXI_IC_REG_AR_QOS_ID_FILTER_4 : R/W; bitpos: [3:0]; default: 15;
 *  filter for enable qos of ar channel id.
 */
#define AXI_IC_REG_AR_QOS_ID_FILTER_4    0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_FILTER_4_M  (AXI_IC_REG_AR_QOS_ID_FILTER_4_V << AXI_IC_REG_AR_QOS_ID_FILTER_4_S)
#define AXI_IC_REG_AR_QOS_ID_FILTER_4_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_FILTER_4_S  0

/** AXI_IC_AR_QOS_ID_FILTER_5_REG register
 *  Config the ar channel id filter for id filter function.
 */
#define AXI_IC_AR_QOS_ID_FILTER_5_REG (DR_REG_AXI_IC_BASE + 0x170)
/** AXI_IC_REG_AR_QOS_ID_FILTER_5 : R/W; bitpos: [3:0]; default: 15;
 *  filter for enable qos of ar channel id.
 */
#define AXI_IC_REG_AR_QOS_ID_FILTER_5    0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_FILTER_5_M  (AXI_IC_REG_AR_QOS_ID_FILTER_5_V << AXI_IC_REG_AR_QOS_ID_FILTER_5_S)
#define AXI_IC_REG_AR_QOS_ID_FILTER_5_V  0x0000000FU
#define AXI_IC_REG_AR_QOS_ID_FILTER_5_S  0

