espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_AW_QOS_CTRL_CFG_0_REG register
 *  Config the QOS Regulator aw module control.
 */
#define AXI_IC_AW_QOS_CTRL_CFG_0_REG (DR_REG_AXI_IC_BASE + 0x174)
/** AXI_IC_REG_AW_QOS_CTRL_CFG_0 : R/W; bitpos: [31:0]; default: 8208;
 *  bit[0] enable channel qos, bit[1] enable debug, bit[7:4] mode of vlu regulate,
 *  bit[15:8] step of dly thr, bit[16] dly cnt rst.
 */
#define AXI_IC_REG_AW_QOS_CTRL_CFG_0    0xFFFFFFFFU
#define AXI_IC_REG_AW_QOS_CTRL_CFG_0_M  (AXI_IC_REG_AW_QOS_CTRL_CFG_0_V << AXI_IC_REG_AW_QOS_CTRL_CFG_0_S)
#define AXI_IC_REG_AW_QOS_CTRL_CFG_0_V  0xFFFFFFFFU
#define AXI_IC_REG_AW_QOS_CTRL_CFG_0_S  0

/** AXI_IC_AW_QOS_CTRL_CFG_1_REG register
 *  Config the QOS Regulator aw module control.
 */
#define AXI_IC_AW_QOS_CTRL_CFG_1_REG (DR_REG_AXI_IC_BASE + 0x178)
/** AXI_IC_REG_AW_QOS_CTRL_CFG_1 : R/W; bitpos: [31:0]; default: 8208;
 *  bit[0] enable channel qos, bit[1] enable debug, bit[7:4] mode of vlu regulate,
 *  bit[15:8] step of dly thr, bit[16] dly cnt rst.
 */
#define AXI_IC_REG_AW_QOS_CTRL_CFG_1    0xFFFFFFFFU
#define AXI_IC_REG_AW_QOS_CTRL_CFG_1_M  (AXI_IC_REG_AW_QOS_CTRL_CFG_1_V << AXI_IC_REG_AW_QOS_CTRL_CFG_1_S)
#define AXI_IC_REG_AW_QOS_CTRL_CFG_1_V  0xFFFFFFFFU
#define AXI_IC_REG_AW_QOS_CTRL_CFG_1_S  0

/** AXI_IC_AW_QOS_CTRL_CFG_2_REG register
 *  Config the QOS Regulator aw module control.
 */
#define AXI_IC_AW_QOS_CTRL_CFG_2_REG (DR_REG_AXI_IC_BASE + 0x17c)
/** AXI_IC_REG_AW_QOS_CTRL_CFG_2 : R/W; bitpos: [31:0]; default: 8208;
 *  bit[0] enable channel qos, bit[1] enable debug, bit[7:4] mode of vlu regulate,
 *  bit[15:8] step of dly thr, bit[16] dly cnt rst.
 */
#define AXI_IC_REG_AW_QOS_CTRL_CFG_2    0xFFFFFFFFU
#define AXI_IC_REG_AW_QOS_CTRL_CFG_2_M  (AXI_IC_REG_AW_QOS_CTRL_CFG_2_V << AXI_IC_REG_AW_QOS_CTRL_CFG_2_S)
#define AXI_IC_REG_AW_QOS_CTRL_CFG_2_V  0xFFFFFFFFU
#define AXI_IC_REG_AW_QOS_CTRL_CFG_2_S  0

/** AXI_IC_AW_QOS_CTRL_CFG_3_REG register
 *  Config the QOS Regulator aw module control.
 */
#define AXI_IC_AW_QOS_CTRL_CFG_3_REG (DR_REG_AXI_IC_BASE + 0x180)
/** AXI_IC_REG_AW_QOS_CTRL_CFG_3 : R/W; bitpos: [31:0]; default: 8208;
 *  bit[0] enable channel qos, bit[1] enable debug, bit[7:4] mode of vlu regulate,
 *  bit[15:8] step of dly thr, bit[16] dly cnt rst.
 */
#define AXI_IC_REG_AW_QOS_CTRL_CFG_3    0xFFFFFFFFU
#define AXI_IC_REG_AW_QOS_CTRL_CFG_3_M  (AXI_IC_REG_AW_QOS_CTRL_CFG_3_V << AXI_IC_REG_AW_QOS_CTRL_CFG_3_S)
#define AXI_IC_REG_AW_QOS_CTRL_CFG_3_V  0xFFFFFFFFU
#define AXI_IC_REG_AW_QOS_CTRL_CFG_3_S  0

/** AXI_IC_AW_QOS_CTRL_CFG_4_REG register
 *  Config the QOS Regulator aw module control.
 */
#define AXI_IC_AW_QOS_CTRL_CFG_4_REG (DR_REG_AXI_IC_BASE + 0x184)
/** AXI_IC_REG_AW_QOS_CTRL_CFG_4 : R/W; bitpos: [31:0]; default: 8208;
 *  bit[0] enable channel qos, bit[1] enable debug, bit[7:4] mode of vlu regulate,
 *  bit[15:8] step of dly thr, bit[16] dly cnt rst.
 */
#define AXI_IC_REG_AW_QOS_CTRL_CFG_4    0xFFFFFFFFU
#define AXI_IC_REG_AW_QOS_CTRL_CFG_4_M  (AXI_IC_REG_AW_QOS_CTRL_CFG_4_V << AXI_IC_REG_AW_QOS_CTRL_CFG_4_S)
#define AXI_IC_REG_AW_QOS_CTRL_CFG_4_V  0xFFFFFFFFU
#define AXI_IC_REG_AW_QOS_CTRL_CFG_4_S  0

/** AXI_IC_AW_QOS_CTRL_CFG_5_REG register
 *  Config the QOS Regulator aw module control.
 */
#define AXI_IC_AW_QOS_CTRL_CFG_5_REG (DR_REG_AXI_IC_BASE + 0x188)
/** AXI_IC_REG_AW_QOS_CTRL_CFG_5 : R/W; bitpos: [31:0]; default: 8208;
 *  bit[0] enable channel qos, bit[1] enable debug, bit[7:4] mode of vlu regulate,
 *  bit[15:8] step of dly thr, bit[16] dly cnt rst.
 */
#define AXI_IC_REG_AW_QOS_CTRL_CFG_5    0xFFFFFFFFU
#define AXI_IC_REG_AW_QOS_CTRL_CFG_5_M  (AXI_IC_REG_AW_QOS_CTRL_CFG_5_V << AXI_IC_REG_AW_QOS_CTRL_CFG_5_S)
#define AXI_IC_REG_AW_QOS_CTRL_CFG_5_V  0xFFFFFFFFU
#define AXI_IC_REG_AW_QOS_CTRL_CFG_5_S  0

/** AXI_IC_AR_QOS_CTRL_CFG_0_REG register
 *  Config the QOS Regulator ar module control.
 */
#define AXI_IC_AR_QOS_CTRL_CFG_0_REG (DR_REG_AXI_IC_BASE + 0x18c)
/** AXI_IC_REG_AR_QOS_CTRL_CFG_0 : R/W; bitpos: [31:0]; default: 8208;
 *  bit[0] enable channel qos, bit[1] enable debug, bit[7:4] mode of vlu regulate,
 *  bit[15:8] step of dly thr, bit[16] dly cnt rst.
 */
#define AXI_IC_REG_AR_QOS_CTRL_CFG_0    0xFFFFFFFFU
#define AXI_IC_REG_AR_QOS_CTRL_CFG_0_M  (AXI_IC_REG_AR_QOS_CTRL_CFG_0_V << AXI_IC_REG_AR_QOS_CTRL_CFG_0_S)
#define AXI_IC_REG_AR_QOS_CTRL_CFG_0_V  0xFFFFFFFFU
#define AXI_IC_REG_AR_QOS_CTRL_CFG_0_S  0

/** AXI_IC_AR_QOS_CTRL_CFG_1_REG register
 *  Config the QOS Regulator ar module control.
 */
#define AXI_IC_AR_QOS_CTRL_CFG_1_REG (DR_REG_AXI_IC_BASE + 0x190)
/** AXI_IC_REG_AR_QOS_CTRL_CFG_1 : R/W; bitpos: [31:0]; default: 8208;
 *  bit[0] enable channel qos, bit[1] enable debug, bit[7:4] mode of vlu regulate,
 *  bit[15:8] step of dly thr, bit[16] dly cnt rst.
 */
#define AXI_IC_REG_AR_QOS_CTRL_CFG_1    0xFFFFFFFFU
#define AXI_IC_REG_AR_QOS_CTRL_CFG_1_M  (AXI_IC_REG_AR_QOS_CTRL_CFG_1_V << AXI_IC_REG_AR_QOS_CTRL_CFG_1_S)
#define AXI_IC_REG_AR_QOS_CTRL_CFG_1_V  0xFFFFFFFFU
#define AXI_IC_REG_AR_QOS_CTRL_CFG_1_S  0

/** AXI_IC_AR_QOS_CTRL_CFG_2_REG register
 *  Config the QOS Regulator ar module control.
 */
#define AXI_IC_AR_QOS_CTRL_CFG_2_REG (DR_REG_AXI_IC_BASE + 0x194)
/** AXI_IC_REG_AR_QOS_CTRL_CFG_2 : R/W; bitpos: [31:0]; default: 8208;
 *  bit[0] enable channel qos, bit[1] enable debug, bit[7:4] mode of vlu regulate,
 *  bit[15:8] step of dly thr, bit[16] dly cnt rst.
 */
#define AXI_IC_REG_AR_QOS_CTRL_CFG_2    0xFFFFFFFFU
#define AXI_IC_REG_AR_QOS_CTRL_CFG_2_M  (AXI_IC_REG_AR_QOS_CTRL_CFG_2_V << AXI_IC_REG_AR_QOS_CTRL_CFG_2_S)
#define AXI_IC_REG_AR_QOS_CTRL_CFG_2_V  0xFFFFFFFFU
#define AXI_IC_REG_AR_QOS_CTRL_CFG_2_S  0

/** AXI_IC_AR_QOS_CTRL_CFG_3_REG register
 *  Config the QOS Regulator ar module control.
 */
#define AXI_IC_AR_QOS_CTRL_CFG_3_REG (DR_REG_AXI_IC_BASE + 0x198)
/** AXI_IC_REG_AR_QOS_CTRL_CFG_3 : R/W; bitpos: [31:0]; default: 8208;
 *  bit[0] enable channel qos, bit[1] enable debug, bit[7:4] mode of vlu regulate,
 *  bit[15:8] step of dly thr, bit[16] dly cnt rst.
 */
#define AXI_IC_REG_AR_QOS_CTRL_CFG_3    0xFFFFFFFFU
#define AXI_IC_REG_AR_QOS_CTRL_CFG_3_M  (AXI_IC_REG_AR_QOS_CTRL_CFG_3_V << AXI_IC_REG_AR_QOS_CTRL_CFG_3_S)
#define AXI_IC_REG_AR_QOS_CTRL_CFG_3_V  0xFFFFFFFFU
#define AXI_IC_REG_AR_QOS_CTRL_CFG_3_S  0

/** AXI_IC_AR_QOS_CTRL_CFG_4_REG register
 *  Config the QOS Regulator ar module control.
 */
#define AXI_IC_AR_QOS_CTRL_CFG_4_REG (DR_REG_AXI_IC_BASE + 0x19c)
/** AXI_IC_REG_AR_QOS_CTRL_CFG_4 : R/W; bitpos: [31:0]; default: 8208;
 *  bit[0] enable channel qos, bit[1] enable debug, bit[7:4] mode of vlu regulate,
 *  bit[15:8] step of dly thr, bit[16] dly cnt rst.
 */
#define AXI_IC_REG_AR_QOS_CTRL_CFG_4    0xFFFFFFFFU
#define AXI_IC_REG_AR_QOS_CTRL_CFG_4_M  (AXI_IC_REG_AR_QOS_CTRL_CFG_4_V << AXI_IC_REG_AR_QOS_CTRL_CFG_4_S)
#define AXI_IC_REG_AR_QOS_CTRL_CFG_4_V  0xFFFFFFFFU
#define AXI_IC_REG_AR_QOS_CTRL_CFG_4_S  0

