espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_AR_QOS_CTRL_CFG_5_REG register
 *  Config the QOS Regulator ar module control.
 */
#define AXI_IC_AR_QOS_CTRL_CFG_5_REG (DR_REG_AXI_IC_BASE + 0x1a0)
/** AXI_IC_REG_AR_QOS_CTRL_CFG_5 : R/W; bitpos: [31:0]; default: 8208;
 *  bit[0] enable channel qos, bit[1] enable debug, bit[7:4] mode of vlu regulate,
 *  bit[15:8] step of dly thr, bit[16] dly cnt rst.
 */
#define AXI_IC_REG_AR_QOS_CTRL_CFG_5    0xFFFFFFFFU
#define AXI_IC_REG_AR_QOS_CTRL_CFG_5_M  (AXI_IC_REG_AR_QOS_CTRL_CFG_5_V << AXI_IC_REG_AR_QOS_CTRL_CFG_5_S)
#define AXI_IC_REG_AR_QOS_CTRL_CFG_5_V  0xFFFFFFFFU
#define AXI_IC_REG_AR_QOS_CTRL_CFG_5_S  0

/** AXI_IC_AW_QOS_TRANS_RATE_0_REG register
 *  Config the Current Master Write bandwidth.
 */
#define AXI_IC_AW_QOS_TRANS_RATE_0_REG (DR_REG_AXI_IC_BASE + 0x1a4)
/** AXI_IC_REG_AW_QOS_TRANS_RATE_0 : R/W; bitpos: [15:0]; default: 12296;
 *  transaction rate, to control the aw channel bandwidth, default 8 cycles 3 tokens.
 */
#define AXI_IC_REG_AW_QOS_TRANS_RATE_0    0x0000FFFFU
#define AXI_IC_REG_AW_QOS_TRANS_RATE_0_M  (AXI_IC_REG_AW_QOS_TRANS_RATE_0_V << AXI_IC_REG_AW_QOS_TRANS_RATE_0_S)
#define AXI_IC_REG_AW_QOS_TRANS_RATE_0_V  0x0000FFFFU
#define AXI_IC_REG_AW_QOS_TRANS_RATE_0_S  0

/** AXI_IC_AW_QOS_TRANS_RATE_1_REG register
 *  Config the Current Master Write bandwidth.
 */
#define AXI_IC_AW_QOS_TRANS_RATE_1_REG (DR_REG_AXI_IC_BASE + 0x1a8)
/** AXI_IC_REG_AW_QOS_TRANS_RATE_1 : R/W; bitpos: [15:0]; default: 12296;
 *  transaction rate, to control the aw channel bandwidth, default 8 cycles 3 tokens.
 */
#define AXI_IC_REG_AW_QOS_TRANS_RATE_1    0x0000FFFFU
#define AXI_IC_REG_AW_QOS_TRANS_RATE_1_M  (AXI_IC_REG_AW_QOS_TRANS_RATE_1_V << AXI_IC_REG_AW_QOS_TRANS_RATE_1_S)
#define AXI_IC_REG_AW_QOS_TRANS_RATE_1_V  0x0000FFFFU
#define AXI_IC_REG_AW_QOS_TRANS_RATE_1_S  0

/** AXI_IC_AW_QOS_TRANS_RATE_2_REG register
 *  Config the Current Master Write bandwidth.
 */
#define AXI_IC_AW_QOS_TRANS_RATE_2_REG (DR_REG_AXI_IC_BASE + 0x1ac)
/** AXI_IC_REG_AW_QOS_TRANS_RATE_2 : R/W; bitpos: [15:0]; default: 12296;
 *  transaction rate, to control the aw channel bandwidth, default 8 cycles 3 tokens.
 */
#define AXI_IC_REG_AW_QOS_TRANS_RATE_2    0x0000FFFFU
#define AXI_IC_REG_AW_QOS_TRANS_RATE_2_M  (AXI_IC_REG_AW_QOS_TRANS_RATE_2_V << AXI_IC_REG_AW_QOS_TRANS_RATE_2_S)
#define AXI_IC_REG_AW_QOS_TRANS_RATE_2_V  0x0000FFFFU
#define AXI_IC_REG_AW_QOS_TRANS_RATE_2_S  0

/** AXI_IC_AW_QOS_TRANS_RATE_3_REG register
 *  Config the Current Master Write bandwidth.
 */
#define AXI_IC_AW_QOS_TRANS_RATE_3_REG (DR_REG_AXI_IC_BASE + 0x1b0)
/** AXI_IC_REG_AW_QOS_TRANS_RATE_3 : R/W; bitpos: [15:0]; default: 12296;
 *  transaction rate, to control the aw channel bandwidth, default 8 cycles 3 tokens.
 */
#define AXI_IC_REG_AW_QOS_TRANS_RATE_3    0x0000FFFFU
#define AXI_IC_REG_AW_QOS_TRANS_RATE_3_M  (AXI_IC_REG_AW_QOS_TRANS_RATE_3_V << AXI_IC_REG_AW_QOS_TRANS_RATE_3_S)
#define AXI_IC_REG_AW_QOS_TRANS_RATE_3_V  0x0000FFFFU
#define AXI_IC_REG_AW_QOS_TRANS_RATE_3_S  0

/** AXI_IC_AW_QOS_TRANS_RATE_4_REG register
 *  Config the Current Master Write bandwidth.
 */
#define AXI_IC_AW_QOS_TRANS_RATE_4_REG (DR_REG_AXI_IC_BASE + 0x1b4)
/** AXI_IC_REG_AW_QOS_TRANS_RATE_4 : R/W; bitpos: [15:0]; default: 12296;
 *  transaction rate, to control the aw channel bandwidth, default 8 cycles 3 tokens.
 */
#define AXI_IC_REG_AW_QOS_TRANS_RATE_4    0x0000FFFFU
#define AXI_IC_REG_AW_QOS_TRANS_RATE_4_M  (AXI_IC_REG_AW_QOS_TRANS_RATE_4_V << AXI_IC_REG_AW_QOS_TRANS_RATE_4_S)
#define AXI_IC_REG_AW_QOS_TRANS_RATE_4_V  0x0000FFFFU
#define AXI_IC_REG_AW_QOS_TRANS_RATE_4_S  0

/** AXI_IC_AW_QOS_TRANS_RATE_5_REG register
 *  Config the Current Master Write bandwidth.
 */
#define AXI_IC_AW_QOS_TRANS_RATE_5_REG (DR_REG_AXI_IC_BASE + 0x1b8)
/** AXI_IC_REG_AW_QOS_TRANS_RATE_5 : R/W; bitpos: [15:0]; default: 12296;
 *  transaction rate, to control the aw channel bandwidth, default 8 cycles 3 tokens.
 */
#define AXI_IC_REG_AW_QOS_TRANS_RATE_5    0x0000FFFFU
#define AXI_IC_REG_AW_QOS_TRANS_RATE_5_M  (AXI_IC_REG_AW_QOS_TRANS_RATE_5_V << AXI_IC_REG_AW_QOS_TRANS_RATE_5_S)
#define AXI_IC_REG_AW_QOS_TRANS_RATE_5_V  0x0000FFFFU
#define AXI_IC_REG_AW_QOS_TRANS_RATE_5_S  0

/** AXI_IC_AR_QOS_TRANS_RATE_0_REG register
 *  Config the Current Master Read bandwidth.
 */
#define AXI_IC_AR_QOS_TRANS_RATE_0_REG (DR_REG_AXI_IC_BASE + 0x1bc)
/** AXI_IC_REG_AR_QOS_TRANS_RATE_0 : R/W; bitpos: [15:0]; default: 12296;
 *  transaction rate, to control the ar channel bandwidth, default 8 cycles 3 tokens.
 */
#define AXI_IC_REG_AR_QOS_TRANS_RATE_0    0x0000FFFFU
#define AXI_IC_REG_AR_QOS_TRANS_RATE_0_M  (AXI_IC_REG_AR_QOS_TRANS_RATE_0_V << AXI_IC_REG_AR_QOS_TRANS_RATE_0_S)
#define AXI_IC_REG_AR_QOS_TRANS_RATE_0_V  0x0000FFFFU
#define AXI_IC_REG_AR_QOS_TRANS_RATE_0_S  0

/** AXI_IC_AR_QOS_TRANS_RATE_1_REG register
 *  Config the Current Master Read bandwidth.
 */
#define AXI_IC_AR_QOS_TRANS_RATE_1_REG (DR_REG_AXI_IC_BASE + 0x1c0)
/** AXI_IC_REG_AR_QOS_TRANS_RATE_1 : R/W; bitpos: [15:0]; default: 12296;
 *  transaction rate, to control the ar channel bandwidth, default 8 cycles 3 tokens.
 */
#define AXI_IC_REG_AR_QOS_TRANS_RATE_1    0x0000FFFFU
#define AXI_IC_REG_AR_QOS_TRANS_RATE_1_M  (AXI_IC_REG_AR_QOS_TRANS_RATE_1_V << AXI_IC_REG_AR_QOS_TRANS_RATE_1_S)
#define AXI_IC_REG_AR_QOS_TRANS_RATE_1_V  0x0000FFFFU
#define AXI_IC_REG_AR_QOS_TRANS_RATE_1_S  0

/** AXI_IC_AR_QOS_TRANS_RATE_2_REG register
 *  Config the Current Master Read bandwidth.
 */
#define AXI_IC_AR_QOS_TRANS_RATE_2_REG (DR_REG_AXI_IC_BASE + 0x1c4)
/** AXI_IC_REG_AR_QOS_TRANS_RATE_2 : R/W; bitpos: [15:0]; default: 12296;
 *  transaction rate, to control the ar channel bandwidth, default 8 cycles 3 tokens.
 */
#define AXI_IC_REG_AR_QOS_TRANS_RATE_2    0x0000FFFFU
#define AXI_IC_REG_AR_QOS_TRANS_RATE_2_M  (AXI_IC_REG_AR_QOS_TRANS_RATE_2_V << AXI_IC_REG_AR_QOS_TRANS_RATE_2_S)
#define AXI_IC_REG_AR_QOS_TRANS_RATE_2_V  0x0000FFFFU
#define AXI_IC_REG_AR_QOS_TRANS_RATE_2_S  0

/** AXI_IC_AR_QOS_TRANS_RATE_3_REG register
 *  Config the Current Master Read bandwidth.
 */
#define AXI_IC_AR_QOS_TRANS_RATE_3_REG (DR_REG_AXI_IC_BASE + 0x1c8)
/** AXI_IC_REG_AR_QOS_TRANS_RATE_3 : R/W; bitpos: [15:0]; default: 12296;
 *  transaction rate, to control the ar channel bandwidth, default 8 cycles 3 tokens.
 */
#define AXI_IC_REG_AR_QOS_TRANS_RATE_3    0x0000FFFFU
#define AXI_IC_REG_AR_QOS_TRANS_RATE_3_M  (AXI_IC_REG_AR_QOS_TRANS_RATE_3_V << AXI_IC_REG_AR_QOS_TRANS_RATE_3_S)
#define AXI_IC_REG_AR_QOS_TRANS_RATE_3_V  0x0000FFFFU
#define AXI_IC_REG_AR_QOS_TRANS_RATE_3_S  0

/** AXI_IC_AR_QOS_TRANS_RATE_4_REG register
 *  Config the Current Master Read bandwidth.
 */
#define AXI_IC_AR_QOS_TRANS_RATE_4_REG (DR_REG_AXI_IC_BASE + 0x1cc)
/** AXI_IC_REG_AR_QOS_TRANS_RATE_4 : R/W; bitpos: [15:0]; default: 12296;
 *  transaction rate, to control the ar channel bandwidth, default 8 cycles 3 tokens.
 */
#define AXI_IC_REG_AR_QOS_TRANS_RATE_4    0x0000FFFFU
#define AXI_IC_REG_AR_QOS_TRANS_RATE_4_M  (AXI_IC_REG_AR_QOS_TRANS_RATE_4_V << AXI_IC_REG_AR_QOS_TRANS_RATE_4_S)
#define AXI_IC_REG_AR_QOS_TRANS_RATE_4_V  0x0000FFFFU
#define AXI_IC_REG_AR_QOS_TRANS_RATE_4_S  0

/** AXI_IC_AR_QOS_TRANS_RATE_5_REG register
 *  Config the Current Master Read bandwidth.
 */
#define AXI_IC_AR_QOS_TRANS_RATE_5_REG (DR_REG_AXI_IC_BASE + 0x1d0)
/** AXI_IC_REG_AR_QOS_TRANS_RATE_5 : R/W; bitpos: [15:0]; default: 12296;
 *  transaction rate, to control the ar channel bandwidth, default 8 cycles 3 tokens.
 */
#define AXI_IC_REG_AR_QOS_TRANS_RATE_5    0x0000FFFFU
#define AXI_IC_REG_AR_QOS_TRANS_RATE_5_M  (AXI_IC_REG_AR_QOS_TRANS_RATE_5_V << AXI_IC_REG_AR_QOS_TRANS_RATE_5_S)
#define AXI_IC_REG_AR_QOS_TRANS_RATE_5_V  0x0000FFFFU
#define AXI_IC_REG_AR_QOS_TRANS_RATE_5_S  0

/** AXI_IC_AW_QOS_PEAK_RATE_0_REG register
 *  Config the Current Master Write Peak bandwidth.
 */
#define AXI_IC_AW_QOS_PEAK_RATE_0_REG (DR_REG_AXI_IC_BASE + 0x1d4)
/** AXI_IC_REG_AW_QOS_PEAK_RATE_0 : R/W; bitpos: [7:0]; default: 0;
 *  peak rate, to control the aw channel request issue rate, default 0.
 */
#define AXI_IC_REG_AW_QOS_PEAK_RATE_0    0x000000FFU
#define AXI_IC_REG_AW_QOS_PEAK_RATE_0_M  (AXI_IC_REG_AW_QOS_PEAK_RATE_0_V << AXI_IC_REG_AW_QOS_PEAK_RATE_0_S)
#define AXI_IC_REG_AW_QOS_PEAK_RATE_0_V  0x000000FFU
#define AXI_IC_REG_AW_QOS_PEAK_RATE_0_S  0

