espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_AW_QOS_PEAK_RATE_1_REG register
 *  Config the Current Master Write Peak bandwidth.
 */
#define AXI_IC_AW_QOS_PEAK_RATE_1_REG (DR_REG_AXI_IC_BASE + 0x1d8)
/** AXI_IC_REG_AW_QOS_PEAK_RATE_1 : R/W; bitpos: [7:0]; default: 0;
 *  peak rate, to control the aw channel request issue rate, default 0.
 */
#define AXI_IC_REG_AW_QOS_PEAK_RATE_1    0x000000FFU
#define AXI_IC_REG_AW_QOS_PEAK_RATE_1_M  (AXI_IC_REG_AW_QOS_PEAK_RATE_1_V << AXI_IC_REG_AW_QOS_PEAK_RATE_1_S)
#define AXI_IC_REG_AW_QOS_PEAK_RATE_1_V  0x000000FFU
#define AXI_IC_REG_AW_QOS_PEAK_RATE_1_S  0

/** AXI_IC_AW_QOS_PEAK_RATE_2_REG register
 *  Config the Current Master Write Peak bandwidth.
 */
#define AXI_IC_AW_QOS_PEAK_RATE_2_REG (DR_REG_AXI_IC_BASE + 0x1dc)
/** AXI_IC_REG_AW_QOS_PEAK_RATE_2 : R/W; bitpos: [7:0]; default: 0;
 *  peak rate, to control the aw channel request issue rate, default 0.
 */
#define AXI_IC_REG_AW_QOS_PEAK_RATE_2    0x000000FFU
#define AXI_IC_REG_AW_QOS_PEAK_RATE_2_M  (AXI_IC_REG_AW_QOS_PEAK_RATE_2_V << AXI_IC_REG_AW_QOS_PEAK_RATE_2_S)
#define AXI_IC_REG_AW_QOS_PEAK_RATE_2_V  0x000000FFU
#define AXI_IC_REG_AW_QOS_PEAK_RATE_2_S  0

/** AXI_IC_AW_QOS_PEAK_RATE_3_REG register
 *  Config the Current Master Write Peak bandwidth.
 */
#define AXI_IC_AW_QOS_PEAK_RATE_3_REG (DR_REG_AXI_IC_BASE + 0x1e0)
/** AXI_IC_REG_AW_QOS_PEAK_RATE_3 : R/W; bitpos: [7:0]; default: 0;
 *  peak rate, to control the aw channel request issue rate, default 0.
 */
#define AXI_IC_REG_AW_QOS_PEAK_RATE_3    0x000000FFU
#define AXI_IC_REG_AW_QOS_PEAK_RATE_3_M  (AXI_IC_REG_AW_QOS_PEAK_RATE_3_V << AXI_IC_REG_AW_QOS_PEAK_RATE_3_S)
#define AXI_IC_REG_AW_QOS_PEAK_RATE_3_V  0x000000FFU
#define AXI_IC_REG_AW_QOS_PEAK_RATE_3_S  0

/** AXI_IC_AW_QOS_PEAK_RATE_4_REG register
 *  Config the Current Master Write Peak bandwidth.
 */
#define AXI_IC_AW_QOS_PEAK_RATE_4_REG (DR_REG_AXI_IC_BASE + 0x1e4)
/** AXI_IC_REG_AW_QOS_PEAK_RATE_4 : R/W; bitpos: [7:0]; default: 0;
 *  peak rate, to control the aw channel request issue rate, default 0.
 */
#define AXI_IC_REG_AW_QOS_PEAK_RATE_4    0x000000FFU
#define AXI_IC_REG_AW_QOS_PEAK_RATE_4_M  (AXI_IC_REG_AW_QOS_PEAK_RATE_4_V << AXI_IC_REG_AW_QOS_PEAK_RATE_4_S)
#define AXI_IC_REG_AW_QOS_PEAK_RATE_4_V  0x000000FFU
#define AXI_IC_REG_AW_QOS_PEAK_RATE_4_S  0

/** AXI_IC_AW_QOS_PEAK_RATE_5_REG register
 *  Config the Current Master Write Peak bandwidth.
 */
#define AXI_IC_AW_QOS_PEAK_RATE_5_REG (DR_REG_AXI_IC_BASE + 0x1e8)
/** AXI_IC_REG_AW_QOS_PEAK_RATE_5 : R/W; bitpos: [7:0]; default: 0;
 *  peak rate, to control the aw channel request issue rate, default 0.
 */
#define AXI_IC_REG_AW_QOS_PEAK_RATE_5    0x000000FFU
#define AXI_IC_REG_AW_QOS_PEAK_RATE_5_M  (AXI_IC_REG_AW_QOS_PEAK_RATE_5_V << AXI_IC_REG_AW_QOS_PEAK_RATE_5_S)
#define AXI_IC_REG_AW_QOS_PEAK_RATE_5_V  0x000000FFU
#define AXI_IC_REG_AW_QOS_PEAK_RATE_5_S  0

/** AXI_IC_AR_QOS_PEAK_RATE_0_REG register
 *  Config the Current Master Read Peak bandwidth.
 */
#define AXI_IC_AR_QOS_PEAK_RATE_0_REG (DR_REG_AXI_IC_BASE + 0x1ec)
/** AXI_IC_REG_AR_QOS_PEAK_RATE_0 : R/W; bitpos: [7:0]; default: 0;
 *  peak rate, to control the ar channel request issue rate, default 0.
 */
#define AXI_IC_REG_AR_QOS_PEAK_RATE_0    0x000000FFU
#define AXI_IC_REG_AR_QOS_PEAK_RATE_0_M  (AXI_IC_REG_AR_QOS_PEAK_RATE_0_V << AXI_IC_REG_AR_QOS_PEAK_RATE_0_S)
#define AXI_IC_REG_AR_QOS_PEAK_RATE_0_V  0x000000FFU
#define AXI_IC_REG_AR_QOS_PEAK_RATE_0_S  0

/** AXI_IC_AR_QOS_PEAK_RATE_1_REG register
 *  Config the Current Master Read Peak bandwidth.
 */
#define AXI_IC_AR_QOS_PEAK_RATE_1_REG (DR_REG_AXI_IC_BASE + 0x1f0)
/** AXI_IC_REG_AR_QOS_PEAK_RATE_1 : R/W; bitpos: [7:0]; default: 0;
 *  peak rate, to control the ar channel request issue rate, default 0.
 */
#define AXI_IC_REG_AR_QOS_PEAK_RATE_1    0x000000FFU
#define AXI_IC_REG_AR_QOS_PEAK_RATE_1_M  (AXI_IC_REG_AR_QOS_PEAK_RATE_1_V << AXI_IC_REG_AR_QOS_PEAK_RATE_1_S)
#define AXI_IC_REG_AR_QOS_PEAK_RATE_1_V  0x000000FFU
#define AXI_IC_REG_AR_QOS_PEAK_RATE_1_S  0

/** AXI_IC_AR_QOS_PEAK_RATE_2_REG register
 *  Config the Current Master Read Peak bandwidth.
 */
#define AXI_IC_AR_QOS_PEAK_RATE_2_REG (DR_REG_AXI_IC_BASE + 0x1f4)
/** AXI_IC_REG_AR_QOS_PEAK_RATE_2 : R/W; bitpos: [7:0]; default: 0;
 *  peak rate, to control the ar channel request issue rate, default 0.
 */
#define AXI_IC_REG_AR_QOS_PEAK_RATE_2    0x000000FFU
#define AXI_IC_REG_AR_QOS_PEAK_RATE_2_M  (AXI_IC_REG_AR_QOS_PEAK_RATE_2_V << AXI_IC_REG_AR_QOS_PEAK_RATE_2_S)
#define AXI_IC_REG_AR_QOS_PEAK_RATE_2_V  0x000000FFU
#define AXI_IC_REG_AR_QOS_PEAK_RATE_2_S  0

/** AXI_IC_AR_QOS_PEAK_RATE_3_REG register
 *  Config the Current Master Read Peak bandwidth.
 */
#define AXI_IC_AR_QOS_PEAK_RATE_3_REG (DR_REG_AXI_IC_BASE + 0x1f8)
/** AXI_IC_REG_AR_QOS_PEAK_RATE_3 : R/W; bitpos: [7:0]; default: 0;
 *  peak rate, to control the ar channel request issue rate, default 0.
 */
#define AXI_IC_REG_AR_QOS_PEAK_RATE_3    0x000000FFU
#define AXI_IC_REG_AR_QOS_PEAK_RATE_3_M  (AXI_IC_REG_AR_QOS_PEAK_RATE_3_V << AXI_IC_REG_AR_QOS_PEAK_RATE_3_S)
#define AXI_IC_REG_AR_QOS_PEAK_RATE_3_V  0x000000FFU
#define AXI_IC_REG_AR_QOS_PEAK_RATE_3_S  0

/** AXI_IC_AR_QOS_PEAK_RATE_4_REG register
 *  Config the Current Master Read Peak bandwidth.
 */
#define AXI_IC_AR_QOS_PEAK_RATE_4_REG (DR_REG_AXI_IC_BASE + 0x1fc)
/** AXI_IC_REG_AR_QOS_PEAK_RATE_4 : R/W; bitpos: [7:0]; default: 0;
 *  peak rate, to control the ar channel request issue rate, default 0.
 */
#define AXI_IC_REG_AR_QOS_PEAK_RATE_4    0x000000FFU
#define AXI_IC_REG_AR_QOS_PEAK_RATE_4_M  (AXI_IC_REG_AR_QOS_PEAK_RATE_4_V << AXI_IC_REG_AR_QOS_PEAK_RATE_4_S)
#define AXI_IC_REG_AR_QOS_PEAK_RATE_4_V  0x000000FFU
#define AXI_IC_REG_AR_QOS_PEAK_RATE_4_S  0

/** AXI_IC_AR_QOS_PEAK_RATE_5_REG register
 *  Config the Current Master Read Peak bandwidth.
 */
#define AXI_IC_AR_QOS_PEAK_RATE_5_REG (DR_REG_AXI_IC_BASE + 0x200)
/** AXI_IC_REG_AR_QOS_PEAK_RATE_5 : R/W; bitpos: [7:0]; default: 0;
 *  peak rate, to control the ar channel request issue rate, default 0.
 */
#define AXI_IC_REG_AR_QOS_PEAK_RATE_5    0x000000FFU
#define AXI_IC_REG_AR_QOS_PEAK_RATE_5_M  (AXI_IC_REG_AR_QOS_PEAK_RATE_5_V << AXI_IC_REG_AR_QOS_PEAK_RATE_5_S)
#define AXI_IC_REG_AR_QOS_PEAK_RATE_5_V  0x000000FFU
#define AXI_IC_REG_AR_QOS_PEAK_RATE_5_S  0

