espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_AW_QOS_BURSTINESS_0_REG register
 *  The Depth for AW channel TOKEN Busrtiness.
 */
#define AXI_IC_AW_QOS_BURSTINESS_0_REG (DR_REG_AXI_IC_BASE + 0x204)
/** AXI_IC_REG_AW_QOS_BURSTINESS_0 : R/W; bitpos: [11:0]; default: 128;
 *  the maximum numbers of the aw channel token, default 128 tokens.
 */
#define AXI_IC_REG_AW_QOS_BURSTINESS_0    0x00000FFFU
#define AXI_IC_REG_AW_QOS_BURSTINESS_0_M  (AXI_IC_REG_AW_QOS_BURSTINESS_0_V << AXI_IC_REG_AW_QOS_BURSTINESS_0_S)
#define AXI_IC_REG_AW_QOS_BURSTINESS_0_V  0x00000FFFU
#define AXI_IC_REG_AW_QOS_BURSTINESS_0_S  0

/** AXI_IC_AW_QOS_BURSTINESS_1_REG register
 *  The Depth for AW channel TOKEN Busrtiness.
 */
#define AXI_IC_AW_QOS_BURSTINESS_1_REG (DR_REG_AXI_IC_BASE + 0x208)
/** AXI_IC_REG_AW_QOS_BURSTINESS_1 : R/W; bitpos: [11:0]; default: 128;
 *  the maximum numbers of the aw channel token, default 128 tokens.
 */
#define AXI_IC_REG_AW_QOS_BURSTINESS_1    0x00000FFFU
#define AXI_IC_REG_AW_QOS_BURSTINESS_1_M  (AXI_IC_REG_AW_QOS_BURSTINESS_1_V << AXI_IC_REG_AW_QOS_BURSTINESS_1_S)
#define AXI_IC_REG_AW_QOS_BURSTINESS_1_V  0x00000FFFU
#define AXI_IC_REG_AW_QOS_BURSTINESS_1_S  0

/** AXI_IC_AW_QOS_BURSTINESS_2_REG register
 *  The Depth for AW channel TOKEN Busrtiness.
 */
#define AXI_IC_AW_QOS_BURSTINESS_2_REG (DR_REG_AXI_IC_BASE + 0x20c)
/** AXI_IC_REG_AW_QOS_BURSTINESS_2 : R/W; bitpos: [11:0]; default: 128;
 *  the maximum numbers of the aw channel token, default 128 tokens.
 */
#define AXI_IC_REG_AW_QOS_BURSTINESS_2    0x00000FFFU
#define AXI_IC_REG_AW_QOS_BURSTINESS_2_M  (AXI_IC_REG_AW_QOS_BURSTINESS_2_V << AXI_IC_REG_AW_QOS_BURSTINESS_2_S)
#define AXI_IC_REG_AW_QOS_BURSTINESS_2_V  0x00000FFFU
#define AXI_IC_REG_AW_QOS_BURSTINESS_2_S  0

/** AXI_IC_AW_QOS_BURSTINESS_3_REG register
 *  The Depth for AW channel TOKEN Busrtiness.
 */
#define AXI_IC_AW_QOS_BURSTINESS_3_REG (DR_REG_AXI_IC_BASE + 0x210)
/** AXI_IC_REG_AW_QOS_BURSTINESS_3 : R/W; bitpos: [11:0]; default: 128;
 *  the maximum numbers of the aw channel token, default 128 tokens.
 */
#define AXI_IC_REG_AW_QOS_BURSTINESS_3    0x00000FFFU
#define AXI_IC_REG_AW_QOS_BURSTINESS_3_M  (AXI_IC_REG_AW_QOS_BURSTINESS_3_V << AXI_IC_REG_AW_QOS_BURSTINESS_3_S)
#define AXI_IC_REG_AW_QOS_BURSTINESS_3_V  0x00000FFFU
#define AXI_IC_REG_AW_QOS_BURSTINESS_3_S  0

/** AXI_IC_AW_QOS_BURSTINESS_4_REG register
 *  The Depth for AW channel TOKEN Busrtiness.
 */
#define AXI_IC_AW_QOS_BURSTINESS_4_REG (DR_REG_AXI_IC_BASE + 0x214)
/** AXI_IC_REG_AW_QOS_BURSTINESS_4 : R/W; bitpos: [11:0]; default: 128;
 *  the maximum numbers of the aw channel token, default 128 tokens.
 */
#define AXI_IC_REG_AW_QOS_BURSTINESS_4    0x00000FFFU
#define AXI_IC_REG_AW_QOS_BURSTINESS_4_M  (AXI_IC_REG_AW_QOS_BURSTINESS_4_V << AXI_IC_REG_AW_QOS_BURSTINESS_4_S)
#define AXI_IC_REG_AW_QOS_BURSTINESS_4_V  0x00000FFFU
#define AXI_IC_REG_AW_QOS_BURSTINESS_4_S  0

/** AXI_IC_AW_QOS_BURSTINESS_5_REG register
 *  The Depth for AW channel TOKEN Busrtiness.
 */
#define AXI_IC_AW_QOS_BURSTINESS_5_REG (DR_REG_AXI_IC_BASE + 0x218)
/** AXI_IC_REG_AW_QOS_BURSTINESS_5 : R/W; bitpos: [11:0]; default: 128;
 *  the maximum numbers of the aw channel token, default 128 tokens.
 */
#define AXI_IC_REG_AW_QOS_BURSTINESS_5    0x00000FFFU
#define AXI_IC_REG_AW_QOS_BURSTINESS_5_M  (AXI_IC_REG_AW_QOS_BURSTINESS_5_V << AXI_IC_REG_AW_QOS_BURSTINESS_5_S)
#define AXI_IC_REG_AW_QOS_BURSTINESS_5_V  0x00000FFFU
#define AXI_IC_REG_AW_QOS_BURSTINESS_5_S  0

/** AXI_IC_AR_QOS_BURSTINESS_0_REG register
 *  The Depth for AR channel TOKEN Busrtiness.
 */
#define AXI_IC_AR_QOS_BURSTINESS_0_REG (DR_REG_AXI_IC_BASE + 0x21c)
/** AXI_IC_REG_AR_QOS_BURSTINESS_0 : R/W; bitpos: [11:0]; default: 128;
 *  the maximum numbers of the ar channel token, default 128 tokens.
 */
#define AXI_IC_REG_AR_QOS_BURSTINESS_0    0x00000FFFU
#define AXI_IC_REG_AR_QOS_BURSTINESS_0_M  (AXI_IC_REG_AR_QOS_BURSTINESS_0_V << AXI_IC_REG_AR_QOS_BURSTINESS_0_S)
#define AXI_IC_REG_AR_QOS_BURSTINESS_0_V  0x00000FFFU
#define AXI_IC_REG_AR_QOS_BURSTINESS_0_S  0

/** AXI_IC_AR_QOS_BURSTINESS_1_REG register
 *  The Depth for AR channel TOKEN Busrtiness.
 */
#define AXI_IC_AR_QOS_BURSTINESS_1_REG (DR_REG_AXI_IC_BASE + 0x220)
/** AXI_IC_REG_AR_QOS_BURSTINESS_1 : R/W; bitpos: [11:0]; default: 128;
 *  the maximum numbers of the ar channel token, default 128 tokens.
 */
#define AXI_IC_REG_AR_QOS_BURSTINESS_1    0x00000FFFU
#define AXI_IC_REG_AR_QOS_BURSTINESS_1_M  (AXI_IC_REG_AR_QOS_BURSTINESS_1_V << AXI_IC_REG_AR_QOS_BURSTINESS_1_S)
#define AXI_IC_REG_AR_QOS_BURSTINESS_1_V  0x00000FFFU
#define AXI_IC_REG_AR_QOS_BURSTINESS_1_S  0

/** AXI_IC_AR_QOS_BURSTINESS_2_REG register
 *  The Depth for AR channel TOKEN Busrtiness.
 */
#define AXI_IC_AR_QOS_BURSTINESS_2_REG (DR_REG_AXI_IC_BASE + 0x224)
/** AXI_IC_REG_AR_QOS_BURSTINESS_2 : R/W; bitpos: [11:0]; default: 128;
 *  the maximum numbers of the ar channel token, default 128 tokens.
 */
#define AXI_IC_REG_AR_QOS_BURSTINESS_2    0x00000FFFU
#define AXI_IC_REG_AR_QOS_BURSTINESS_2_M  (AXI_IC_REG_AR_QOS_BURSTINESS_2_V << AXI_IC_REG_AR_QOS_BURSTINESS_2_S)
#define AXI_IC_REG_AR_QOS_BURSTINESS_2_V  0x00000FFFU
#define AXI_IC_REG_AR_QOS_BURSTINESS_2_S  0

/** AXI_IC_AR_QOS_BURSTINESS_3_REG register
 *  The Depth for AR channel TOKEN Busrtiness.
 */
#define AXI_IC_AR_QOS_BURSTINESS_3_REG (DR_REG_AXI_IC_BASE + 0x228)
/** AXI_IC_REG_AR_QOS_BURSTINESS_3 : R/W; bitpos: [11:0]; default: 128;
 *  the maximum numbers of the ar channel token, default 128 tokens.
 */
#define AXI_IC_REG_AR_QOS_BURSTINESS_3    0x00000FFFU
#define AXI_IC_REG_AR_QOS_BURSTINESS_3_M  (AXI_IC_REG_AR_QOS_BURSTINESS_3_V << AXI_IC_REG_AR_QOS_BURSTINESS_3_S)
#define AXI_IC_REG_AR_QOS_BURSTINESS_3_V  0x00000FFFU
#define AXI_IC_REG_AR_QOS_BURSTINESS_3_S  0

/** AXI_IC_AR_QOS_BURSTINESS_4_REG register
 *  The Depth for AR channel TOKEN Busrtiness.
 */
#define AXI_IC_AR_QOS_BURSTINESS_4_REG (DR_REG_AXI_IC_BASE + 0x22c)
/** AXI_IC_REG_AR_QOS_BURSTINESS_4 : R/W; bitpos: [11:0]; default: 128;
 *  the maximum numbers of the ar channel token, default 128 tokens.
 */
#define AXI_IC_REG_AR_QOS_BURSTINESS_4    0x00000FFFU
#define AXI_IC_REG_AR_QOS_BURSTINESS_4_M  (AXI_IC_REG_AR_QOS_BURSTINESS_4_V << AXI_IC_REG_AR_QOS_BURSTINESS_4_S)
#define AXI_IC_REG_AR_QOS_BURSTINESS_4_V  0x00000FFFU
#define AXI_IC_REG_AR_QOS_BURSTINESS_4_S  0

