espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_AR_QOS_BURSTINESS_5_REG register
 *  The Depth for AR channel TOKEN Busrtiness.
 */
#define AXI_IC_AR_QOS_BURSTINESS_5_REG (DR_REG_AXI_IC_BASE + 0x230)
/** AXI_IC_REG_AR_QOS_BURSTINESS_5 : R/W; bitpos: [11:0]; default: 128;
 *  the maximum numbers of the ar channel token, default 128 tokens.
 */
#define AXI_IC_REG_AR_QOS_BURSTINESS_5    0x00000FFFU
#define AXI_IC_REG_AR_QOS_BURSTINESS_5_M  (AXI_IC_REG_AR_QOS_BURSTINESS_5_V << AXI_IC_REG_AR_QOS_BURSTINESS_5_S)
#define AXI_IC_REG_AR_QOS_BURSTINESS_5_V  0x00000FFFU
#define AXI_IC_REG_AR_QOS_BURSTINESS_5_S  0

/** AXI_IC_AW_QOS_CFG_VLU_0_REG register
 *  Config the QOS Priority in AW channel.
 */
#define AXI_IC_AW_QOS_CFG_VLU_0_REG (DR_REG_AXI_IC_BASE + 0x234)
/** AXI_IC_REG_AW_QOS_CFG_VLU_0 : R/W; bitpos: [15:0]; default: 55906;
 *  the four level of the aw channel qos priority, default is 2,6,10,13
 */
#define AXI_IC_REG_AW_QOS_CFG_VLU_0    0x0000FFFFU
#define AXI_IC_REG_AW_QOS_CFG_VLU_0_M  (AXI_IC_REG_AW_QOS_CFG_VLU_0_V << AXI_IC_REG_AW_QOS_CFG_VLU_0_S)
#define AXI_IC_REG_AW_QOS_CFG_VLU_0_V  0x0000FFFFU
#define AXI_IC_REG_AW_QOS_CFG_VLU_0_S  0

/** AXI_IC_AW_QOS_CFG_VLU_1_REG register
 *  Config the QOS Priority in AW channel.
 */
#define AXI_IC_AW_QOS_CFG_VLU_1_REG (DR_REG_AXI_IC_BASE + 0x238)
/** AXI_IC_REG_AW_QOS_CFG_VLU_1 : R/W; bitpos: [15:0]; default: 55906;
 *  the four level of the aw channel qos priority, default is 2,6,10,13
 */
#define AXI_IC_REG_AW_QOS_CFG_VLU_1    0x0000FFFFU
#define AXI_IC_REG_AW_QOS_CFG_VLU_1_M  (AXI_IC_REG_AW_QOS_CFG_VLU_1_V << AXI_IC_REG_AW_QOS_CFG_VLU_1_S)
#define AXI_IC_REG_AW_QOS_CFG_VLU_1_V  0x0000FFFFU
#define AXI_IC_REG_AW_QOS_CFG_VLU_1_S  0

/** AXI_IC_AW_QOS_CFG_VLU_2_REG register
 *  Config the QOS Priority in AW channel.
 */
#define AXI_IC_AW_QOS_CFG_VLU_2_REG (DR_REG_AXI_IC_BASE + 0x23c)
/** AXI_IC_REG_AW_QOS_CFG_VLU_2 : R/W; bitpos: [15:0]; default: 55906;
 *  the four level of the aw channel qos priority, default is 2,6,10,13
 */
#define AXI_IC_REG_AW_QOS_CFG_VLU_2    0x0000FFFFU
#define AXI_IC_REG_AW_QOS_CFG_VLU_2_M  (AXI_IC_REG_AW_QOS_CFG_VLU_2_V << AXI_IC_REG_AW_QOS_CFG_VLU_2_S)
#define AXI_IC_REG_AW_QOS_CFG_VLU_2_V  0x0000FFFFU
#define AXI_IC_REG_AW_QOS_CFG_VLU_2_S  0

/** AXI_IC_AW_QOS_CFG_VLU_3_REG register
 *  Config the QOS Priority in AW channel.
 */
#define AXI_IC_AW_QOS_CFG_VLU_3_REG (DR_REG_AXI_IC_BASE + 0x240)
/** AXI_IC_REG_AW_QOS_CFG_VLU_3 : R/W; bitpos: [15:0]; default: 55906;
 *  the four level of the aw channel qos priority, default is 2,6,10,13
 */
#define AXI_IC_REG_AW_QOS_CFG_VLU_3    0x0000FFFFU
#define AXI_IC_REG_AW_QOS_CFG_VLU_3_M  (AXI_IC_REG_AW_QOS_CFG_VLU_3_V << AXI_IC_REG_AW_QOS_CFG_VLU_3_S)
#define AXI_IC_REG_AW_QOS_CFG_VLU_3_V  0x0000FFFFU
#define AXI_IC_REG_AW_QOS_CFG_VLU_3_S  0

/** AXI_IC_AW_QOS_CFG_VLU_4_REG register
 *  Config the QOS Priority in AW channel.
 */
#define AXI_IC_AW_QOS_CFG_VLU_4_REG (DR_REG_AXI_IC_BASE + 0x244)
/** AXI_IC_REG_AW_QOS_CFG_VLU_4 : R/W; bitpos: [15:0]; default: 55906;
 *  the four level of the aw channel qos priority, default is 2,6,10,13
 */
#define AXI_IC_REG_AW_QOS_CFG_VLU_4    0x0000FFFFU
#define AXI_IC_REG_AW_QOS_CFG_VLU_4_M  (AXI_IC_REG_AW_QOS_CFG_VLU_4_V << AXI_IC_REG_AW_QOS_CFG_VLU_4_S)
#define AXI_IC_REG_AW_QOS_CFG_VLU_4_V  0x0000FFFFU
#define AXI_IC_REG_AW_QOS_CFG_VLU_4_S  0

/** AXI_IC_AW_QOS_CFG_VLU_5_REG register
 *  Config the QOS Priority in AW channel.
 */
#define AXI_IC_AW_QOS_CFG_VLU_5_REG (DR_REG_AXI_IC_BASE + 0x248)
/** AXI_IC_REG_AW_QOS_CFG_VLU_5 : R/W; bitpos: [15:0]; default: 55906;
 *  the four level of the aw channel qos priority, default is 2,6,10,13
 */
#define AXI_IC_REG_AW_QOS_CFG_VLU_5    0x0000FFFFU
#define AXI_IC_REG_AW_QOS_CFG_VLU_5_M  (AXI_IC_REG_AW_QOS_CFG_VLU_5_V << AXI_IC_REG_AW_QOS_CFG_VLU_5_S)
#define AXI_IC_REG_AW_QOS_CFG_VLU_5_V  0x0000FFFFU
#define AXI_IC_REG_AW_QOS_CFG_VLU_5_S  0

/** AXI_IC_AR_QOS_CFG_VLU_0_REG register
 *  Config the QOS Priority in AR channel.
 */
#define AXI_IC_AR_QOS_CFG_VLU_0_REG (DR_REG_AXI_IC_BASE + 0x24c)
/** AXI_IC_REG_AR_QOS_CFG_VLU_0 : R/W; bitpos: [15:0]; default: 55906;
 *  the four level of the ar channel qos priority, default is 2,6,10,13
 */
#define AXI_IC_REG_AR_QOS_CFG_VLU_0    0x0000FFFFU
#define AXI_IC_REG_AR_QOS_CFG_VLU_0_M  (AXI_IC_REG_AR_QOS_CFG_VLU_0_V << AXI_IC_REG_AR_QOS_CFG_VLU_0_S)
#define AXI_IC_REG_AR_QOS_CFG_VLU_0_V  0x0000FFFFU
#define AXI_IC_REG_AR_QOS_CFG_VLU_0_S  0

/** AXI_IC_AR_QOS_CFG_VLU_1_REG register
 *  Config the QOS Priority in AR channel.
 */
#define AXI_IC_AR_QOS_CFG_VLU_1_REG (DR_REG_AXI_IC_BASE + 0x250)
/** AXI_IC_REG_AR_QOS_CFG_VLU_1 : R/W; bitpos: [15:0]; default: 55906;
 *  the four level of the ar channel qos priority, default is 2,6,10,13
 */
#define AXI_IC_REG_AR_QOS_CFG_VLU_1    0x0000FFFFU
#define AXI_IC_REG_AR_QOS_CFG_VLU_1_M  (AXI_IC_REG_AR_QOS_CFG_VLU_1_V << AXI_IC_REG_AR_QOS_CFG_VLU_1_S)
#define AXI_IC_REG_AR_QOS_CFG_VLU_1_V  0x0000FFFFU
#define AXI_IC_REG_AR_QOS_CFG_VLU_1_S  0

/** AXI_IC_AR_QOS_CFG_VLU_2_REG register
 *  Config the QOS Priority in AR channel.
 */
#define AXI_IC_AR_QOS_CFG_VLU_2_REG (DR_REG_AXI_IC_BASE + 0x254)
/** AXI_IC_REG_AR_QOS_CFG_VLU_2 : R/W; bitpos: [15:0]; default: 55906;
 *  the four level of the ar channel qos priority, default is 2,6,10,13
 */
#define AXI_IC_REG_AR_QOS_CFG_VLU_2    0x0000FFFFU
#define AXI_IC_REG_AR_QOS_CFG_VLU_2_M  (AXI_IC_REG_AR_QOS_CFG_VLU_2_V << AXI_IC_REG_AR_QOS_CFG_VLU_2_S)
#define AXI_IC_REG_AR_QOS_CFG_VLU_2_V  0x0000FFFFU
#define AXI_IC_REG_AR_QOS_CFG_VLU_2_S  0

/** AXI_IC_AR_QOS_CFG_VLU_3_REG register
 *  Config the QOS Priority in AR channel.
 */
#define AXI_IC_AR_QOS_CFG_VLU_3_REG (DR_REG_AXI_IC_BASE + 0x258)
/** AXI_IC_REG_AR_QOS_CFG_VLU_3 : R/W; bitpos: [15:0]; default: 55906;
 *  the four level of the ar channel qos priority, default is 2,6,10,13
 */
#define AXI_IC_REG_AR_QOS_CFG_VLU_3    0x0000FFFFU
#define AXI_IC_REG_AR_QOS_CFG_VLU_3_M  (AXI_IC_REG_AR_QOS_CFG_VLU_3_V << AXI_IC_REG_AR_QOS_CFG_VLU_3_S)
#define AXI_IC_REG_AR_QOS_CFG_VLU_3_V  0x0000FFFFU
#define AXI_IC_REG_AR_QOS_CFG_VLU_3_S  0

