espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_AR_QOS_CFG_VLU_4_REG register
 *  Config the QOS Priority in AR channel.
 */
#define AXI_IC_AR_QOS_CFG_VLU_4_REG (DR_REG_AXI_IC_BASE + 0x25c)
/** AXI_IC_REG_AR_QOS_CFG_VLU_4 : R/W; bitpos: [15:0]; default: 55906;
 *  the four level of the ar channel qos priority, default is 2,6,10,13
 */
#define AXI_IC_REG_AR_QOS_CFG_VLU_4    0x0000FFFFU
#define AXI_IC_REG_AR_QOS_CFG_VLU_4_M  (AXI_IC_REG_AR_QOS_CFG_VLU_4_V << AXI_IC_REG_AR_QOS_CFG_VLU_4_S)
#define AXI_IC_REG_AR_QOS_CFG_VLU_4_V  0x0000FFFFU
#define AXI_IC_REG_AR_QOS_CFG_VLU_4_S  0

/** AXI_IC_AR_QOS_CFG_VLU_5_REG register
 *  Config the QOS Priority in AR channel.
 */
#define AXI_IC_AR_QOS_CFG_VLU_5_REG (DR_REG_AXI_IC_BASE + 0x260)
/** AXI_IC_REG_AR_QOS_CFG_VLU_5 : R/W; bitpos: [15:0]; default: 55906;
 *  the four level of the ar channel qos priority, default is 2,6,10,13
 */
#define AXI_IC_REG_AR_QOS_CFG_VLU_5    0x0000FFFFU
#define AXI_IC_REG_AR_QOS_CFG_VLU_5_M  (AXI_IC_REG_AR_QOS_CFG_VLU_5_V << AXI_IC_REG_AR_QOS_CFG_VLU_5_S)
#define AXI_IC_REG_AR_QOS_CFG_VLU_5_V  0x0000FFFFU
#define AXI_IC_REG_AR_QOS_CFG_VLU_5_S  0

/** AXI_IC_AW_QOS_DLY_THR0_0_REG register
 *  Config the first level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR0_0_REG (DR_REG_AXI_IC_BASE + 0x264)
/** AXI_IC_REG_AW_QOS_DLY_THR0_0 : R/W; bitpos: [12:0]; default: 32;
 *  the first level of the aw channel delay threshold, default is 32.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR0_0    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR0_0_M  (AXI_IC_REG_AW_QOS_DLY_THR0_0_V << AXI_IC_REG_AW_QOS_DLY_THR0_0_S)
#define AXI_IC_REG_AW_QOS_DLY_THR0_0_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR0_0_S  0

/** AXI_IC_AW_QOS_DLY_THR0_1_REG register
 *  Config the first level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR0_1_REG (DR_REG_AXI_IC_BASE + 0x268)
/** AXI_IC_REG_AW_QOS_DLY_THR0_1 : R/W; bitpos: [12:0]; default: 32;
 *  the first level of the aw channel delay threshold, default is 32.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR0_1    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR0_1_M  (AXI_IC_REG_AW_QOS_DLY_THR0_1_V << AXI_IC_REG_AW_QOS_DLY_THR0_1_S)
#define AXI_IC_REG_AW_QOS_DLY_THR0_1_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR0_1_S  0

/** AXI_IC_AW_QOS_DLY_THR0_2_REG register
 *  Config the first level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR0_2_REG (DR_REG_AXI_IC_BASE + 0x26c)
/** AXI_IC_REG_AW_QOS_DLY_THR0_2 : R/W; bitpos: [12:0]; default: 32;
 *  the first level of the aw channel delay threshold, default is 32.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR0_2    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR0_2_M  (AXI_IC_REG_AW_QOS_DLY_THR0_2_V << AXI_IC_REG_AW_QOS_DLY_THR0_2_S)
#define AXI_IC_REG_AW_QOS_DLY_THR0_2_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR0_2_S  0

/** AXI_IC_AW_QOS_DLY_THR0_3_REG register
 *  Config the first level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR0_3_REG (DR_REG_AXI_IC_BASE + 0x270)
/** AXI_IC_REG_AW_QOS_DLY_THR0_3 : R/W; bitpos: [12:0]; default: 32;
 *  the first level of the aw channel delay threshold, default is 32.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR0_3    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR0_3_M  (AXI_IC_REG_AW_QOS_DLY_THR0_3_V << AXI_IC_REG_AW_QOS_DLY_THR0_3_S)
#define AXI_IC_REG_AW_QOS_DLY_THR0_3_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR0_3_S  0

/** AXI_IC_AW_QOS_DLY_THR0_4_REG register
 *  Config the first level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR0_4_REG (DR_REG_AXI_IC_BASE + 0x274)
/** AXI_IC_REG_AW_QOS_DLY_THR0_4 : R/W; bitpos: [12:0]; default: 32;
 *  the first level of the aw channel delay threshold, default is 32.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR0_4    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR0_4_M  (AXI_IC_REG_AW_QOS_DLY_THR0_4_V << AXI_IC_REG_AW_QOS_DLY_THR0_4_S)
#define AXI_IC_REG_AW_QOS_DLY_THR0_4_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR0_4_S  0

/** AXI_IC_AW_QOS_DLY_THR0_5_REG register
 *  Config the first level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR0_5_REG (DR_REG_AXI_IC_BASE + 0x278)
/** AXI_IC_REG_AW_QOS_DLY_THR0_5 : R/W; bitpos: [12:0]; default: 32;
 *  the first level of the aw channel delay threshold, default is 32.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR0_5    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR0_5_M  (AXI_IC_REG_AW_QOS_DLY_THR0_5_V << AXI_IC_REG_AW_QOS_DLY_THR0_5_S)
#define AXI_IC_REG_AW_QOS_DLY_THR0_5_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR0_5_S  0

/** AXI_IC_AW_QOS_DLY_THR1_0_REG register
 *  Config the second level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR1_0_REG (DR_REG_AXI_IC_BASE + 0x27c)
/** AXI_IC_REG_AW_QOS_DLY_THR1_0 : R/W; bitpos: [12:0]; default: 160;
 *  the second level of the aw channel delay threshold, default is 160.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR1_0    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR1_0_M  (AXI_IC_REG_AW_QOS_DLY_THR1_0_V << AXI_IC_REG_AW_QOS_DLY_THR1_0_S)
#define AXI_IC_REG_AW_QOS_DLY_THR1_0_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR1_0_S  0

/** AXI_IC_AW_QOS_DLY_THR1_1_REG register
 *  Config the second level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR1_1_REG (DR_REG_AXI_IC_BASE + 0x280)
/** AXI_IC_REG_AW_QOS_DLY_THR1_1 : R/W; bitpos: [12:0]; default: 160;
 *  the second level of the aw channel delay threshold, default is 160.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR1_1    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR1_1_M  (AXI_IC_REG_AW_QOS_DLY_THR1_1_V << AXI_IC_REG_AW_QOS_DLY_THR1_1_S)
#define AXI_IC_REG_AW_QOS_DLY_THR1_1_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR1_1_S  0

/** AXI_IC_AW_QOS_DLY_THR1_2_REG register
 *  Config the second level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR1_2_REG (DR_REG_AXI_IC_BASE + 0x284)
/** AXI_IC_REG_AW_QOS_DLY_THR1_2 : R/W; bitpos: [12:0]; default: 160;
 *  the second level of the aw channel delay threshold, default is 160.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR1_2    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR1_2_M  (AXI_IC_REG_AW_QOS_DLY_THR1_2_V << AXI_IC_REG_AW_QOS_DLY_THR1_2_S)
#define AXI_IC_REG_AW_QOS_DLY_THR1_2_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR1_2_S  0

/** AXI_IC_AW_QOS_DLY_THR1_3_REG register
 *  Config the second level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR1_3_REG (DR_REG_AXI_IC_BASE + 0x288)
/** AXI_IC_REG_AW_QOS_DLY_THR1_3 : R/W; bitpos: [12:0]; default: 160;
 *  the second level of the aw channel delay threshold, default is 160.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR1_3    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR1_3_M  (AXI_IC_REG_AW_QOS_DLY_THR1_3_V << AXI_IC_REG_AW_QOS_DLY_THR1_3_S)
#define AXI_IC_REG_AW_QOS_DLY_THR1_3_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR1_3_S  0

/** AXI_IC_AW_QOS_DLY_THR1_4_REG register
 *  Config the second level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR1_4_REG (DR_REG_AXI_IC_BASE + 0x28c)
/** AXI_IC_REG_AW_QOS_DLY_THR1_4 : R/W; bitpos: [12:0]; default: 160;
 *  the second level of the aw channel delay threshold, default is 160.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR1_4    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR1_4_M  (AXI_IC_REG_AW_QOS_DLY_THR1_4_V << AXI_IC_REG_AW_QOS_DLY_THR1_4_S)
#define AXI_IC_REG_AW_QOS_DLY_THR1_4_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR1_4_S  0

/** AXI_IC_AW_QOS_DLY_THR1_5_REG register
 *  Config the second level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR1_5_REG (DR_REG_AXI_IC_BASE + 0x290)
/** AXI_IC_REG_AW_QOS_DLY_THR1_5 : R/W; bitpos: [12:0]; default: 160;
 *  the second level of the aw channel delay threshold, default is 160.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR1_5    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR1_5_M  (AXI_IC_REG_AW_QOS_DLY_THR1_5_V << AXI_IC_REG_AW_QOS_DLY_THR1_5_S)
#define AXI_IC_REG_AW_QOS_DLY_THR1_5_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR1_5_S  0

/** AXI_IC_AW_QOS_DLY_THR2_0_REG register
 *  Config the third level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR2_0_REG (DR_REG_AXI_IC_BASE + 0x294)
/** AXI_IC_REG_AW_QOS_DLY_THR2_0 : R/W; bitpos: [12:0]; default: 416;
 *  the third level of the aw channel delay threshold, default is 416.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR2_0    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR2_0_M  (AXI_IC_REG_AW_QOS_DLY_THR2_0_V << AXI_IC_REG_AW_QOS_DLY_THR2_0_S)
#define AXI_IC_REG_AW_QOS_DLY_THR2_0_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR2_0_S  0

