espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_AW_QOS_DLY_THR2_1_REG register
 *  Config the third level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR2_1_REG (DR_REG_AXI_IC_BASE + 0x298)
/** AXI_IC_REG_AW_QOS_DLY_THR2_1 : R/W; bitpos: [12:0]; default: 416;
 *  the third level of the aw channel delay threshold, default is 416.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR2_1    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR2_1_M  (AXI_IC_REG_AW_QOS_DLY_THR2_1_V << AXI_IC_REG_AW_QOS_DLY_THR2_1_S)
#define AXI_IC_REG_AW_QOS_DLY_THR2_1_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR2_1_S  0

/** AXI_IC_AW_QOS_DLY_THR2_2_REG register
 *  Config the third level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR2_2_REG (DR_REG_AXI_IC_BASE + 0x29c)
/** AXI_IC_REG_AW_QOS_DLY_THR2_2 : R/W; bitpos: [12:0]; default: 416;
 *  the third level of the aw channel delay threshold, default is 416.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR2_2    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR2_2_M  (AXI_IC_REG_AW_QOS_DLY_THR2_2_V << AXI_IC_REG_AW_QOS_DLY_THR2_2_S)
#define AXI_IC_REG_AW_QOS_DLY_THR2_2_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR2_2_S  0

/** AXI_IC_AW_QOS_DLY_THR2_3_REG register
 *  Config the third level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR2_3_REG (DR_REG_AXI_IC_BASE + 0x2a0)
/** AXI_IC_REG_AW_QOS_DLY_THR2_3 : R/W; bitpos: [12:0]; default: 416;
 *  the third level of the aw channel delay threshold, default is 416.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR2_3    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR2_3_M  (AXI_IC_REG_AW_QOS_DLY_THR2_3_V << AXI_IC_REG_AW_QOS_DLY_THR2_3_S)
#define AXI_IC_REG_AW_QOS_DLY_THR2_3_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR2_3_S  0

/** AXI_IC_AW_QOS_DLY_THR2_4_REG register
 *  Config the third level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR2_4_REG (DR_REG_AXI_IC_BASE + 0x2a4)
/** AXI_IC_REG_AW_QOS_DLY_THR2_4 : R/W; bitpos: [12:0]; default: 416;
 *  the third level of the aw channel delay threshold, default is 416.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR2_4    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR2_4_M  (AXI_IC_REG_AW_QOS_DLY_THR2_4_V << AXI_IC_REG_AW_QOS_DLY_THR2_4_S)
#define AXI_IC_REG_AW_QOS_DLY_THR2_4_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR2_4_S  0

/** AXI_IC_AW_QOS_DLY_THR2_5_REG register
 *  Config the third level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR2_5_REG (DR_REG_AXI_IC_BASE + 0x2a8)
/** AXI_IC_REG_AW_QOS_DLY_THR2_5 : R/W; bitpos: [12:0]; default: 416;
 *  the third level of the aw channel delay threshold, default is 416.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR2_5    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR2_5_M  (AXI_IC_REG_AW_QOS_DLY_THR2_5_V << AXI_IC_REG_AW_QOS_DLY_THR2_5_S)
#define AXI_IC_REG_AW_QOS_DLY_THR2_5_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR2_5_S  0

/** AXI_IC_AW_QOS_DLY_THR3_0_REG register
 *  Config the forth level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR3_0_REG (DR_REG_AXI_IC_BASE + 0x2ac)
/** AXI_IC_REG_AW_QOS_DLY_THR3_0 : R/W; bitpos: [12:0]; default: 928;
 *  the forth level of the aw channel delay threshold, default is 928.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR3_0    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR3_0_M  (AXI_IC_REG_AW_QOS_DLY_THR3_0_V << AXI_IC_REG_AW_QOS_DLY_THR3_0_S)
#define AXI_IC_REG_AW_QOS_DLY_THR3_0_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR3_0_S  0

/** AXI_IC_AW_QOS_DLY_THR3_1_REG register
 *  Config the forth level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR3_1_REG (DR_REG_AXI_IC_BASE + 0x2b0)
/** AXI_IC_REG_AW_QOS_DLY_THR3_1 : R/W; bitpos: [12:0]; default: 928;
 *  the forth level of the aw channel delay threshold, default is 928.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR3_1    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR3_1_M  (AXI_IC_REG_AW_QOS_DLY_THR3_1_V << AXI_IC_REG_AW_QOS_DLY_THR3_1_S)
#define AXI_IC_REG_AW_QOS_DLY_THR3_1_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR3_1_S  0

/** AXI_IC_AW_QOS_DLY_THR3_2_REG register
 *  Config the forth level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR3_2_REG (DR_REG_AXI_IC_BASE + 0x2b4)
/** AXI_IC_REG_AW_QOS_DLY_THR3_2 : R/W; bitpos: [12:0]; default: 928;
 *  the forth level of the aw channel delay threshold, default is 928.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR3_2    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR3_2_M  (AXI_IC_REG_AW_QOS_DLY_THR3_2_V << AXI_IC_REG_AW_QOS_DLY_THR3_2_S)
#define AXI_IC_REG_AW_QOS_DLY_THR3_2_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR3_2_S  0

/** AXI_IC_AW_QOS_DLY_THR3_3_REG register
 *  Config the forth level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR3_3_REG (DR_REG_AXI_IC_BASE + 0x2b8)
/** AXI_IC_REG_AW_QOS_DLY_THR3_3 : R/W; bitpos: [12:0]; default: 928;
 *  the forth level of the aw channel delay threshold, default is 928.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR3_3    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR3_3_M  (AXI_IC_REG_AW_QOS_DLY_THR3_3_V << AXI_IC_REG_AW_QOS_DLY_THR3_3_S)
#define AXI_IC_REG_AW_QOS_DLY_THR3_3_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR3_3_S  0

/** AXI_IC_AW_QOS_DLY_THR3_4_REG register
 *  Config the forth level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR3_4_REG (DR_REG_AXI_IC_BASE + 0x2bc)
/** AXI_IC_REG_AW_QOS_DLY_THR3_4 : R/W; bitpos: [12:0]; default: 928;
 *  the forth level of the aw channel delay threshold, default is 928.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR3_4    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR3_4_M  (AXI_IC_REG_AW_QOS_DLY_THR3_4_V << AXI_IC_REG_AW_QOS_DLY_THR3_4_S)
#define AXI_IC_REG_AW_QOS_DLY_THR3_4_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR3_4_S  0

/** AXI_IC_AW_QOS_DLY_THR3_5_REG register
 *  Config the forth level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AW_QOS_DLY_THR3_5_REG (DR_REG_AXI_IC_BASE + 0x2c0)
/** AXI_IC_REG_AW_QOS_DLY_THR3_5 : R/W; bitpos: [12:0]; default: 928;
 *  the forth level of the aw channel delay threshold, default is 928.
 */
#define AXI_IC_REG_AW_QOS_DLY_THR3_5    0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR3_5_M  (AXI_IC_REG_AW_QOS_DLY_THR3_5_V << AXI_IC_REG_AW_QOS_DLY_THR3_5_S)
#define AXI_IC_REG_AW_QOS_DLY_THR3_5_V  0x00001FFFU
#define AXI_IC_REG_AW_QOS_DLY_THR3_5_S  0

