espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_AR_QOS_DLY_THR0_0_REG register
 *  Config the first level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR0_0_REG (DR_REG_AXI_IC_BASE + 0x2c4)
/** AXI_IC_REG_AR_QOS_DLY_THR0_0 : R/W; bitpos: [12:0]; default: 32;
 *  the first level of the ar channel delay threshold, default is 32.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR0_0    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR0_0_M  (AXI_IC_REG_AR_QOS_DLY_THR0_0_V << AXI_IC_REG_AR_QOS_DLY_THR0_0_S)
#define AXI_IC_REG_AR_QOS_DLY_THR0_0_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR0_0_S  0

/** AXI_IC_AR_QOS_DLY_THR0_1_REG register
 *  Config the first level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR0_1_REG (DR_REG_AXI_IC_BASE + 0x2c8)
/** AXI_IC_REG_AR_QOS_DLY_THR0_1 : R/W; bitpos: [12:0]; default: 32;
 *  the first level of the ar channel delay threshold, default is 32.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR0_1    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR0_1_M  (AXI_IC_REG_AR_QOS_DLY_THR0_1_V << AXI_IC_REG_AR_QOS_DLY_THR0_1_S)
#define AXI_IC_REG_AR_QOS_DLY_THR0_1_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR0_1_S  0

/** AXI_IC_AR_QOS_DLY_THR0_2_REG register
 *  Config the first level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR0_2_REG (DR_REG_AXI_IC_BASE + 0x2cc)
/** AXI_IC_REG_AR_QOS_DLY_THR0_2 : R/W; bitpos: [12:0]; default: 32;
 *  the first level of the ar channel delay threshold, default is 32.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR0_2    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR0_2_M  (AXI_IC_REG_AR_QOS_DLY_THR0_2_V << AXI_IC_REG_AR_QOS_DLY_THR0_2_S)
#define AXI_IC_REG_AR_QOS_DLY_THR0_2_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR0_2_S  0

/** AXI_IC_AR_QOS_DLY_THR0_3_REG register
 *  Config the first level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR0_3_REG (DR_REG_AXI_IC_BASE + 0x2d0)
/** AXI_IC_REG_AR_QOS_DLY_THR0_3 : R/W; bitpos: [12:0]; default: 32;
 *  the first level of the ar channel delay threshold, default is 32.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR0_3    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR0_3_M  (AXI_IC_REG_AR_QOS_DLY_THR0_3_V << AXI_IC_REG_AR_QOS_DLY_THR0_3_S)
#define AXI_IC_REG_AR_QOS_DLY_THR0_3_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR0_3_S  0

/** AXI_IC_AR_QOS_DLY_THR0_4_REG register
 *  Config the first level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR0_4_REG (DR_REG_AXI_IC_BASE + 0x2d4)
/** AXI_IC_REG_AR_QOS_DLY_THR0_4 : R/W; bitpos: [12:0]; default: 32;
 *  the first level of the ar channel delay threshold, default is 32.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR0_4    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR0_4_M  (AXI_IC_REG_AR_QOS_DLY_THR0_4_V << AXI_IC_REG_AR_QOS_DLY_THR0_4_S)
#define AXI_IC_REG_AR_QOS_DLY_THR0_4_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR0_4_S  0

/** AXI_IC_AR_QOS_DLY_THR0_5_REG register
 *  Config the first level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR0_5_REG (DR_REG_AXI_IC_BASE + 0x2d8)
/** AXI_IC_REG_AR_QOS_DLY_THR0_5 : R/W; bitpos: [12:0]; default: 32;
 *  the first level of the ar channel delay threshold, default is 32.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR0_5    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR0_5_M  (AXI_IC_REG_AR_QOS_DLY_THR0_5_V << AXI_IC_REG_AR_QOS_DLY_THR0_5_S)
#define AXI_IC_REG_AR_QOS_DLY_THR0_5_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR0_5_S  0

/** AXI_IC_AR_QOS_DLY_THR1_0_REG register
 *  Config the second level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR1_0_REG (DR_REG_AXI_IC_BASE + 0x2dc)
/** AXI_IC_REG_AR_QOS_DLY_THR1_0 : R/W; bitpos: [12:0]; default: 160;
 *  the second level of the ar channel delay threshold, default is 160.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR1_0    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR1_0_M  (AXI_IC_REG_AR_QOS_DLY_THR1_0_V << AXI_IC_REG_AR_QOS_DLY_THR1_0_S)
#define AXI_IC_REG_AR_QOS_DLY_THR1_0_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR1_0_S  0

/** AXI_IC_AR_QOS_DLY_THR1_1_REG register
 *  Config the second level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR1_1_REG (DR_REG_AXI_IC_BASE + 0x2e0)
/** AXI_IC_REG_AR_QOS_DLY_THR1_1 : R/W; bitpos: [12:0]; default: 160;
 *  the second level of the ar channel delay threshold, default is 160.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR1_1    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR1_1_M  (AXI_IC_REG_AR_QOS_DLY_THR1_1_V << AXI_IC_REG_AR_QOS_DLY_THR1_1_S)
#define AXI_IC_REG_AR_QOS_DLY_THR1_1_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR1_1_S  0

/** AXI_IC_AR_QOS_DLY_THR1_2_REG register
 *  Config the second level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR1_2_REG (DR_REG_AXI_IC_BASE + 0x2e4)
/** AXI_IC_REG_AR_QOS_DLY_THR1_2 : R/W; bitpos: [12:0]; default: 160;
 *  the second level of the ar channel delay threshold, default is 160.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR1_2    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR1_2_M  (AXI_IC_REG_AR_QOS_DLY_THR1_2_V << AXI_IC_REG_AR_QOS_DLY_THR1_2_S)
#define AXI_IC_REG_AR_QOS_DLY_THR1_2_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR1_2_S  0

/** AXI_IC_AR_QOS_DLY_THR1_3_REG register
 *  Config the second level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR1_3_REG (DR_REG_AXI_IC_BASE + 0x2e8)
/** AXI_IC_REG_AR_QOS_DLY_THR1_3 : R/W; bitpos: [12:0]; default: 160;
 *  the second level of the ar channel delay threshold, default is 160.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR1_3    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR1_3_M  (AXI_IC_REG_AR_QOS_DLY_THR1_3_V << AXI_IC_REG_AR_QOS_DLY_THR1_3_S)
#define AXI_IC_REG_AR_QOS_DLY_THR1_3_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR1_3_S  0

/** AXI_IC_AR_QOS_DLY_THR1_4_REG register
 *  Config the second level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR1_4_REG (DR_REG_AXI_IC_BASE + 0x2ec)
/** AXI_IC_REG_AR_QOS_DLY_THR1_4 : R/W; bitpos: [12:0]; default: 160;
 *  the second level of the ar channel delay threshold, default is 160.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR1_4    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR1_4_M  (AXI_IC_REG_AR_QOS_DLY_THR1_4_V << AXI_IC_REG_AR_QOS_DLY_THR1_4_S)
#define AXI_IC_REG_AR_QOS_DLY_THR1_4_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR1_4_S  0

