espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_AR_QOS_DLY_THR1_5_REG register
 *  Config the second level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR1_5_REG (DR_REG_AXI_IC_BASE + 0x2f0)
/** AXI_IC_REG_AR_QOS_DLY_THR1_5 : R/W; bitpos: [12:0]; default: 160;
 *  the second level of the ar channel delay threshold, default is 160.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR1_5    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR1_5_M  (AXI_IC_REG_AR_QOS_DLY_THR1_5_V << AXI_IC_REG_AR_QOS_DLY_THR1_5_S)
#define AXI_IC_REG_AR_QOS_DLY_THR1_5_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR1_5_S  0

/** AXI_IC_AR_QOS_DLY_THR2_0_REG register
 *  Config the third level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR2_0_REG (DR_REG_AXI_IC_BASE + 0x2f4)
/** AXI_IC_REG_AR_QOS_DLY_THR2_0 : R/W; bitpos: [12:0]; default: 416;
 *  the third level of the ar channel delay threshold, default is 416.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR2_0    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR2_0_M  (AXI_IC_REG_AR_QOS_DLY_THR2_0_V << AXI_IC_REG_AR_QOS_DLY_THR2_0_S)
#define AXI_IC_REG_AR_QOS_DLY_THR2_0_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR2_0_S  0

/** AXI_IC_AR_QOS_DLY_THR2_1_REG register
 *  Config the third level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR2_1_REG (DR_REG_AXI_IC_BASE + 0x2f8)
/** AXI_IC_REG_AR_QOS_DLY_THR2_1 : R/W; bitpos: [12:0]; default: 416;
 *  the third level of the ar channel delay threshold, default is 416.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR2_1    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR2_1_M  (AXI_IC_REG_AR_QOS_DLY_THR2_1_V << AXI_IC_REG_AR_QOS_DLY_THR2_1_S)
#define AXI_IC_REG_AR_QOS_DLY_THR2_1_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR2_1_S  0

/** AXI_IC_AR_QOS_DLY_THR2_2_REG register
 *  Config the third level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR2_2_REG (DR_REG_AXI_IC_BASE + 0x2fc)
/** AXI_IC_REG_AR_QOS_DLY_THR2_2 : R/W; bitpos: [12:0]; default: 416;
 *  the third level of the ar channel delay threshold, default is 416.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR2_2    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR2_2_M  (AXI_IC_REG_AR_QOS_DLY_THR2_2_V << AXI_IC_REG_AR_QOS_DLY_THR2_2_S)
#define AXI_IC_REG_AR_QOS_DLY_THR2_2_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR2_2_S  0

/** AXI_IC_AR_QOS_DLY_THR2_3_REG register
 *  Config the third level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR2_3_REG (DR_REG_AXI_IC_BASE + 0x300)
/** AXI_IC_REG_AR_QOS_DLY_THR2_3 : R/W; bitpos: [12:0]; default: 416;
 *  the third level of the ar channel delay threshold, default is 416.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR2_3    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR2_3_M  (AXI_IC_REG_AR_QOS_DLY_THR2_3_V << AXI_IC_REG_AR_QOS_DLY_THR2_3_S)
#define AXI_IC_REG_AR_QOS_DLY_THR2_3_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR2_3_S  0

/** AXI_IC_AR_QOS_DLY_THR2_4_REG register
 *  Config the third level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR2_4_REG (DR_REG_AXI_IC_BASE + 0x304)
/** AXI_IC_REG_AR_QOS_DLY_THR2_4 : R/W; bitpos: [12:0]; default: 416;
 *  the third level of the ar channel delay threshold, default is 416.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR2_4    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR2_4_M  (AXI_IC_REG_AR_QOS_DLY_THR2_4_V << AXI_IC_REG_AR_QOS_DLY_THR2_4_S)
#define AXI_IC_REG_AR_QOS_DLY_THR2_4_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR2_4_S  0

/** AXI_IC_AR_QOS_DLY_THR2_5_REG register
 *  Config the third level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR2_5_REG (DR_REG_AXI_IC_BASE + 0x308)
/** AXI_IC_REG_AR_QOS_DLY_THR2_5 : R/W; bitpos: [12:0]; default: 416;
 *  the third level of the ar channel delay threshold, default is 416.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR2_5    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR2_5_M  (AXI_IC_REG_AR_QOS_DLY_THR2_5_V << AXI_IC_REG_AR_QOS_DLY_THR2_5_S)
#define AXI_IC_REG_AR_QOS_DLY_THR2_5_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR2_5_S  0

/** AXI_IC_AR_QOS_DLY_THR3_0_REG register
 *  Config the forth level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR3_0_REG (DR_REG_AXI_IC_BASE + 0x30c)
/** AXI_IC_REG_AR_QOS_DLY_THR3_0 : R/W; bitpos: [12:0]; default: 928;
 *  the forth level of the ar channel delay threshold, default is 928.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR3_0    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR3_0_M  (AXI_IC_REG_AR_QOS_DLY_THR3_0_V << AXI_IC_REG_AR_QOS_DLY_THR3_0_S)
#define AXI_IC_REG_AR_QOS_DLY_THR3_0_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR3_0_S  0

/** AXI_IC_AR_QOS_DLY_THR3_1_REG register
 *  Config the forth level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR3_1_REG (DR_REG_AXI_IC_BASE + 0x310)
/** AXI_IC_REG_AR_QOS_DLY_THR3_1 : R/W; bitpos: [12:0]; default: 928;
 *  the forth level of the ar channel delay threshold, default is 928.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR3_1    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR3_1_M  (AXI_IC_REG_AR_QOS_DLY_THR3_1_V << AXI_IC_REG_AR_QOS_DLY_THR3_1_S)
#define AXI_IC_REG_AR_QOS_DLY_THR3_1_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR3_1_S  0

/** AXI_IC_AR_QOS_DLY_THR3_2_REG register
 *  Config the forth level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR3_2_REG (DR_REG_AXI_IC_BASE + 0x314)
/** AXI_IC_REG_AR_QOS_DLY_THR3_2 : R/W; bitpos: [12:0]; default: 928;
 *  the forth level of the ar channel delay threshold, default is 928.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR3_2    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR3_2_M  (AXI_IC_REG_AR_QOS_DLY_THR3_2_V << AXI_IC_REG_AR_QOS_DLY_THR3_2_S)
#define AXI_IC_REG_AR_QOS_DLY_THR3_2_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR3_2_S  0

/** AXI_IC_AR_QOS_DLY_THR3_3_REG register
 *  Config the forth level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR3_3_REG (DR_REG_AXI_IC_BASE + 0x318)
/** AXI_IC_REG_AR_QOS_DLY_THR3_3 : R/W; bitpos: [12:0]; default: 928;
 *  the forth level of the ar channel delay threshold, default is 928.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR3_3    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR3_3_M  (AXI_IC_REG_AR_QOS_DLY_THR3_3_V << AXI_IC_REG_AR_QOS_DLY_THR3_3_S)
#define AXI_IC_REG_AR_QOS_DLY_THR3_3_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR3_3_S  0

/** AXI_IC_AR_QOS_DLY_THR3_4_REG register
 *  Config the forth level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR3_4_REG (DR_REG_AXI_IC_BASE + 0x31c)
/** AXI_IC_REG_AR_QOS_DLY_THR3_4 : R/W; bitpos: [12:0]; default: 928;
 *  the forth level of the ar channel delay threshold, default is 928.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR3_4    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR3_4_M  (AXI_IC_REG_AR_QOS_DLY_THR3_4_V << AXI_IC_REG_AR_QOS_DLY_THR3_4_S)
#define AXI_IC_REG_AR_QOS_DLY_THR3_4_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR3_4_S  0

/** AXI_IC_AR_QOS_DLY_THR3_5_REG register
 *  Config the forth level delay threshold for first priority in AW channel.
 */
#define AXI_IC_AR_QOS_DLY_THR3_5_REG (DR_REG_AXI_IC_BASE + 0x320)
/** AXI_IC_REG_AR_QOS_DLY_THR3_5 : R/W; bitpos: [12:0]; default: 928;
 *  the forth level of the ar channel delay threshold, default is 928.
 */
#define AXI_IC_REG_AR_QOS_DLY_THR3_5    0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR3_5_M  (AXI_IC_REG_AR_QOS_DLY_THR3_5_V << AXI_IC_REG_AR_QOS_DLY_THR3_5_S)
#define AXI_IC_REG_AR_QOS_DLY_THR3_5_V  0x00001FFFU
#define AXI_IC_REG_AR_QOS_DLY_THR3_5_S  0

/** AXI_IC_AW_QOS_BUR_LEN_THR_0_REG register
 *  Config the min value of token which can enable axi write transaction.
 */
#define AXI_IC_AW_QOS_BUR_LEN_THR_0_REG (DR_REG_AXI_IC_BASE + 0x324)
/** AXI_IC_REG_AW_QOS_BUR_LEN_THR_0 : R/W; bitpos: [9:0]; default: 64;
 *  limit the starting token value of aw channel to turn on transmission, default value
 *  is 64, 0 means no limit.
 */
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_0    0x000003FFU
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_0_M  (AXI_IC_REG_AW_QOS_BUR_LEN_THR_0_V << AXI_IC_REG_AW_QOS_BUR_LEN_THR_0_S)
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_0_V  0x000003FFU
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_0_S  0

/** AXI_IC_AW_QOS_BUR_LEN_THR_1_REG register
 *  Config the min value of token which can enable axi write transaction.
 */
#define AXI_IC_AW_QOS_BUR_LEN_THR_1_REG (DR_REG_AXI_IC_BASE + 0x328)
/** AXI_IC_REG_AW_QOS_BUR_LEN_THR_1 : R/W; bitpos: [9:0]; default: 64;
 *  limit the starting token value of aw channel to turn on transmission, default value
 *  is 64, 0 means no limit.
 */
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_1    0x000003FFU
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_1_M  (AXI_IC_REG_AW_QOS_BUR_LEN_THR_1_V << AXI_IC_REG_AW_QOS_BUR_LEN_THR_1_S)
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_1_V  0x000003FFU
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_1_S  0

/** AXI_IC_AW_QOS_BUR_LEN_THR_2_REG register
 *  Config the min value of token which can enable axi write transaction.
 */
#define AXI_IC_AW_QOS_BUR_LEN_THR_2_REG (DR_REG_AXI_IC_BASE + 0x32c)
/** AXI_IC_REG_AW_QOS_BUR_LEN_THR_2 : R/W; bitpos: [9:0]; default: 64;
 *  limit the starting token value of aw channel to turn on transmission, default value
 *  is 64, 0 means no limit.
 */
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_2    0x000003FFU
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_2_M  (AXI_IC_REG_AW_QOS_BUR_LEN_THR_2_V << AXI_IC_REG_AW_QOS_BUR_LEN_THR_2_S)
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_2_V  0x000003FFU
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_2_S  0

