espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_AW_QOS_BUR_LEN_THR_3_REG register
 *  Config the min value of token which can enable axi write transaction.
 */
#define AXI_IC_AW_QOS_BUR_LEN_THR_3_REG (DR_REG_AXI_IC_BASE + 0x330)
/** AXI_IC_REG_AW_QOS_BUR_LEN_THR_3 : R/W; bitpos: [9:0]; default: 64;
 *  limit the starting token value of aw channel to turn on transmission, default value
 *  is 64, 0 means no limit.
 */
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_3    0x000003FFU
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_3_M  (AXI_IC_REG_AW_QOS_BUR_LEN_THR_3_V << AXI_IC_REG_AW_QOS_BUR_LEN_THR_3_S)
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_3_V  0x000003FFU
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_3_S  0

/** AXI_IC_AW_QOS_BUR_LEN_THR_4_REG register
 *  Config the min value of token which can enable axi write transaction.
 */
#define AXI_IC_AW_QOS_BUR_LEN_THR_4_REG (DR_REG_AXI_IC_BASE + 0x334)
/** AXI_IC_REG_AW_QOS_BUR_LEN_THR_4 : R/W; bitpos: [9:0]; default: 64;
 *  limit the starting token value of aw channel to turn on transmission, default value
 *  is 64, 0 means no limit.
 */
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_4    0x000003FFU
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_4_M  (AXI_IC_REG_AW_QOS_BUR_LEN_THR_4_V << AXI_IC_REG_AW_QOS_BUR_LEN_THR_4_S)
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_4_V  0x000003FFU
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_4_S  0

/** AXI_IC_AW_QOS_BUR_LEN_THR_5_REG register
 *  Config the min value of token which can enable axi write transaction.
 */
#define AXI_IC_AW_QOS_BUR_LEN_THR_5_REG (DR_REG_AXI_IC_BASE + 0x338)
/** AXI_IC_REG_AW_QOS_BUR_LEN_THR_5 : R/W; bitpos: [9:0]; default: 64;
 *  limit the starting token value of aw channel to turn on transmission, default value
 *  is 64, 0 means no limit.
 */
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_5    0x000003FFU
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_5_M  (AXI_IC_REG_AW_QOS_BUR_LEN_THR_5_V << AXI_IC_REG_AW_QOS_BUR_LEN_THR_5_S)
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_5_V  0x000003FFU
#define AXI_IC_REG_AW_QOS_BUR_LEN_THR_5_S  0

/** AXI_IC_AR_QOS_BUR_LEN_THR_0_REG register
 *  Config the min value of token which can enable axi read transaction.
 */
#define AXI_IC_AR_QOS_BUR_LEN_THR_0_REG (DR_REG_AXI_IC_BASE + 0x33c)
/** AXI_IC_REG_AR_QOS_BUR_LEN_THR_0 : R/W; bitpos: [9:0]; default: 64;
 *  limit the starting token value of ar channel to turn on transmission, default value
 *  is 64, 0 means no limit.
 */
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_0    0x000003FFU
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_0_M  (AXI_IC_REG_AR_QOS_BUR_LEN_THR_0_V << AXI_IC_REG_AR_QOS_BUR_LEN_THR_0_S)
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_0_V  0x000003FFU
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_0_S  0

/** AXI_IC_AR_QOS_BUR_LEN_THR_1_REG register
 *  Config the min value of token which can enable axi read transaction.
 */
#define AXI_IC_AR_QOS_BUR_LEN_THR_1_REG (DR_REG_AXI_IC_BASE + 0x340)
/** AXI_IC_REG_AR_QOS_BUR_LEN_THR_1 : R/W; bitpos: [9:0]; default: 64;
 *  limit the starting token value of ar channel to turn on transmission, default value
 *  is 64, 0 means no limit.
 */
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_1    0x000003FFU
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_1_M  (AXI_IC_REG_AR_QOS_BUR_LEN_THR_1_V << AXI_IC_REG_AR_QOS_BUR_LEN_THR_1_S)
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_1_V  0x000003FFU
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_1_S  0

/** AXI_IC_AR_QOS_BUR_LEN_THR_2_REG register
 *  Config the min value of token which can enable axi read transaction.
 */
#define AXI_IC_AR_QOS_BUR_LEN_THR_2_REG (DR_REG_AXI_IC_BASE + 0x344)
/** AXI_IC_REG_AR_QOS_BUR_LEN_THR_2 : R/W; bitpos: [9:0]; default: 64;
 *  limit the starting token value of ar channel to turn on transmission, default value
 *  is 64, 0 means no limit.
 */
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_2    0x000003FFU
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_2_M  (AXI_IC_REG_AR_QOS_BUR_LEN_THR_2_V << AXI_IC_REG_AR_QOS_BUR_LEN_THR_2_S)
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_2_V  0x000003FFU
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_2_S  0

/** AXI_IC_AR_QOS_BUR_LEN_THR_3_REG register
 *  Config the min value of token which can enable axi read transaction.
 */
#define AXI_IC_AR_QOS_BUR_LEN_THR_3_REG (DR_REG_AXI_IC_BASE + 0x348)
/** AXI_IC_REG_AR_QOS_BUR_LEN_THR_3 : R/W; bitpos: [9:0]; default: 64;
 *  limit the starting token value of ar channel to turn on transmission, default value
 *  is 64, 0 means no limit.
 */
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_3    0x000003FFU
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_3_M  (AXI_IC_REG_AR_QOS_BUR_LEN_THR_3_V << AXI_IC_REG_AR_QOS_BUR_LEN_THR_3_S)
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_3_V  0x000003FFU
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_3_S  0

/** AXI_IC_AR_QOS_BUR_LEN_THR_4_REG register
 *  Config the min value of token which can enable axi read transaction.
 */
#define AXI_IC_AR_QOS_BUR_LEN_THR_4_REG (DR_REG_AXI_IC_BASE + 0x34c)
/** AXI_IC_REG_AR_QOS_BUR_LEN_THR_4 : R/W; bitpos: [9:0]; default: 64;
 *  limit the starting token value of ar channel to turn on transmission, default value
 *  is 64, 0 means no limit.
 */
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_4    0x000003FFU
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_4_M  (AXI_IC_REG_AR_QOS_BUR_LEN_THR_4_V << AXI_IC_REG_AR_QOS_BUR_LEN_THR_4_S)
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_4_V  0x000003FFU
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_4_S  0

/** AXI_IC_AR_QOS_BUR_LEN_THR_5_REG register
 *  Config the min value of token which can enable axi read transaction.
 */
#define AXI_IC_AR_QOS_BUR_LEN_THR_5_REG (DR_REG_AXI_IC_BASE + 0x350)
/** AXI_IC_REG_AR_QOS_BUR_LEN_THR_5 : R/W; bitpos: [9:0]; default: 64;
 *  limit the starting token value of ar channel to turn on transmission, default value
 *  is 64, 0 means no limit.
 */
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_5    0x000003FFU
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_5_M  (AXI_IC_REG_AR_QOS_BUR_LEN_THR_5_V << AXI_IC_REG_AR_QOS_BUR_LEN_THR_5_S)
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_5_V  0x000003FFU
#define AXI_IC_REG_AR_QOS_BUR_LEN_THR_5_S  0

/** AXI_IC_AW_QOS_DBG_TK_THR_0_REG register
 *  Config the debug smple interval in aw channel.
 */
#define AXI_IC_AW_QOS_DBG_TK_THR_0_REG (DR_REG_AXI_IC_BASE + 0x354)
/** AXI_IC_REG_AW_QOS_DBG_TK_THR_0 : R/W; bitpos: [7:0]; default: 16;
 *  limit the debug sample interval, default value is 16
 */
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_0    0x000000FFU
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_0_M  (AXI_IC_REG_AW_QOS_DBG_TK_THR_0_V << AXI_IC_REG_AW_QOS_DBG_TK_THR_0_S)
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_0_V  0x000000FFU
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_0_S  0

