espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_AW_QOS_DBG_TK_THR_1_REG register
 *  Config the debug smple interval in aw channel.
 */
#define AXI_IC_AW_QOS_DBG_TK_THR_1_REG (DR_REG_AXI_IC_BASE + 0x358)
/** AXI_IC_REG_AW_QOS_DBG_TK_THR_1 : R/W; bitpos: [7:0]; default: 16;
 *  limit the debug sample interval, default value is 16
 */
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_1    0x000000FFU
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_1_M  (AXI_IC_REG_AW_QOS_DBG_TK_THR_1_V << AXI_IC_REG_AW_QOS_DBG_TK_THR_1_S)
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_1_V  0x000000FFU
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_1_S  0

/** AXI_IC_AW_QOS_DBG_TK_THR_2_REG register
 *  Config the debug smple interval in aw channel.
 */
#define AXI_IC_AW_QOS_DBG_TK_THR_2_REG (DR_REG_AXI_IC_BASE + 0x35c)
/** AXI_IC_REG_AW_QOS_DBG_TK_THR_2 : R/W; bitpos: [7:0]; default: 16;
 *  limit the debug sample interval, default value is 16
 */
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_2    0x000000FFU
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_2_M  (AXI_IC_REG_AW_QOS_DBG_TK_THR_2_V << AXI_IC_REG_AW_QOS_DBG_TK_THR_2_S)
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_2_V  0x000000FFU
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_2_S  0

/** AXI_IC_AW_QOS_DBG_TK_THR_3_REG register
 *  Config the debug smple interval in aw channel.
 */
#define AXI_IC_AW_QOS_DBG_TK_THR_3_REG (DR_REG_AXI_IC_BASE + 0x360)
/** AXI_IC_REG_AW_QOS_DBG_TK_THR_3 : R/W; bitpos: [7:0]; default: 16;
 *  limit the debug sample interval, default value is 16
 */
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_3    0x000000FFU
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_3_M  (AXI_IC_REG_AW_QOS_DBG_TK_THR_3_V << AXI_IC_REG_AW_QOS_DBG_TK_THR_3_S)
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_3_V  0x000000FFU
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_3_S  0

/** AXI_IC_AW_QOS_DBG_TK_THR_4_REG register
 *  Config the debug smple interval in aw channel.
 */
#define AXI_IC_AW_QOS_DBG_TK_THR_4_REG (DR_REG_AXI_IC_BASE + 0x364)
/** AXI_IC_REG_AW_QOS_DBG_TK_THR_4 : R/W; bitpos: [7:0]; default: 16;
 *  limit the debug sample interval, default value is 16
 */
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_4    0x000000FFU
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_4_M  (AXI_IC_REG_AW_QOS_DBG_TK_THR_4_V << AXI_IC_REG_AW_QOS_DBG_TK_THR_4_S)
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_4_V  0x000000FFU
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_4_S  0

/** AXI_IC_AW_QOS_DBG_TK_THR_5_REG register
 *  Config the debug smple interval in aw channel.
 */
#define AXI_IC_AW_QOS_DBG_TK_THR_5_REG (DR_REG_AXI_IC_BASE + 0x368)
/** AXI_IC_REG_AW_QOS_DBG_TK_THR_5 : R/W; bitpos: [7:0]; default: 16;
 *  limit the debug sample interval, default value is 16
 */
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_5    0x000000FFU
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_5_M  (AXI_IC_REG_AW_QOS_DBG_TK_THR_5_V << AXI_IC_REG_AW_QOS_DBG_TK_THR_5_S)
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_5_V  0x000000FFU
#define AXI_IC_REG_AW_QOS_DBG_TK_THR_5_S  0

/** AXI_IC_AR_QOS_DBG_TK_THR_0_REG register
 *  Config the debug smple interval in ar channel.
 */
#define AXI_IC_AR_QOS_DBG_TK_THR_0_REG (DR_REG_AXI_IC_BASE + 0x36c)
/** AXI_IC_REG_AR_QOS_DBG_TK_THR_0 : R/W; bitpos: [7:0]; default: 16;
 *  limit the debug sample interval, default value is 16
 */
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_0    0x000000FFU
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_0_M  (AXI_IC_REG_AR_QOS_DBG_TK_THR_0_V << AXI_IC_REG_AR_QOS_DBG_TK_THR_0_S)
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_0_V  0x000000FFU
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_0_S  0

/** AXI_IC_AR_QOS_DBG_TK_THR_1_REG register
 *  Config the debug smple interval in ar channel.
 */
#define AXI_IC_AR_QOS_DBG_TK_THR_1_REG (DR_REG_AXI_IC_BASE + 0x370)
/** AXI_IC_REG_AR_QOS_DBG_TK_THR_1 : R/W; bitpos: [7:0]; default: 16;
 *  limit the debug sample interval, default value is 16
 */
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_1    0x000000FFU
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_1_M  (AXI_IC_REG_AR_QOS_DBG_TK_THR_1_V << AXI_IC_REG_AR_QOS_DBG_TK_THR_1_S)
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_1_V  0x000000FFU
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_1_S  0

/** AXI_IC_AR_QOS_DBG_TK_THR_2_REG register
 *  Config the debug smple interval in ar channel.
 */
#define AXI_IC_AR_QOS_DBG_TK_THR_2_REG (DR_REG_AXI_IC_BASE + 0x374)
/** AXI_IC_REG_AR_QOS_DBG_TK_THR_2 : R/W; bitpos: [7:0]; default: 16;
 *  limit the debug sample interval, default value is 16
 */
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_2    0x000000FFU
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_2_M  (AXI_IC_REG_AR_QOS_DBG_TK_THR_2_V << AXI_IC_REG_AR_QOS_DBG_TK_THR_2_S)
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_2_V  0x000000FFU
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_2_S  0

/** AXI_IC_AR_QOS_DBG_TK_THR_3_REG register
 *  Config the debug smple interval in ar channel.
 */
#define AXI_IC_AR_QOS_DBG_TK_THR_3_REG (DR_REG_AXI_IC_BASE + 0x378)
/** AXI_IC_REG_AR_QOS_DBG_TK_THR_3 : R/W; bitpos: [7:0]; default: 16;
 *  limit the debug sample interval, default value is 16
 */
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_3    0x000000FFU
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_3_M  (AXI_IC_REG_AR_QOS_DBG_TK_THR_3_V << AXI_IC_REG_AR_QOS_DBG_TK_THR_3_S)
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_3_V  0x000000FFU
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_3_S  0

/** AXI_IC_AR_QOS_DBG_TK_THR_4_REG register
 *  Config the debug smple interval in ar channel.
 */
#define AXI_IC_AR_QOS_DBG_TK_THR_4_REG (DR_REG_AXI_IC_BASE + 0x37c)
/** AXI_IC_REG_AR_QOS_DBG_TK_THR_4 : R/W; bitpos: [7:0]; default: 16;
 *  limit the debug sample interval, default value is 16
 */
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_4    0x000000FFU
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_4_M  (AXI_IC_REG_AR_QOS_DBG_TK_THR_4_V << AXI_IC_REG_AR_QOS_DBG_TK_THR_4_S)
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_4_V  0x000000FFU
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_4_S  0

/** AXI_IC_AR_QOS_DBG_TK_THR_5_REG register
 *  Config the debug smple interval in ar channel.
 */
#define AXI_IC_AR_QOS_DBG_TK_THR_5_REG (DR_REG_AXI_IC_BASE + 0x380)
/** AXI_IC_REG_AR_QOS_DBG_TK_THR_5 : R/W; bitpos: [7:0]; default: 16;
 *  limit the debug sample interval, default value is 16
 */
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_5    0x000000FFU
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_5_M  (AXI_IC_REG_AR_QOS_DBG_TK_THR_5_V << AXI_IC_REG_AR_QOS_DBG_TK_THR_5_S)
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_5_V  0x000000FFU
#define AXI_IC_REG_AR_QOS_DBG_TK_THR_5_S  0

/** AXI_IC_MAX_OST_AW_S_0_REG register
 *  Config the max outstanding num in current slave write port.
 */
#define AXI_IC_MAX_OST_AW_S_0_REG (DR_REG_AXI_IC_BASE + 0x384)
/** AXI_IC_REG_MAX_OST_AW_S_0 : R/W; bitpos: [5:0]; default: 15;
 *  limit the number of outstanding for slave port, default value is 15, max is 32.
 */
#define AXI_IC_REG_MAX_OST_AW_S_0    0x0000003FU
#define AXI_IC_REG_MAX_OST_AW_S_0_M  (AXI_IC_REG_MAX_OST_AW_S_0_V << AXI_IC_REG_MAX_OST_AW_S_0_S)
#define AXI_IC_REG_MAX_OST_AW_S_0_V  0x0000003FU
#define AXI_IC_REG_MAX_OST_AW_S_0_S  0

/** AXI_IC_MAX_OST_AW_S_1_REG register
 *  Config the max outstanding num in current slave write port.
 */
#define AXI_IC_MAX_OST_AW_S_1_REG (DR_REG_AXI_IC_BASE + 0x388)
/** AXI_IC_REG_MAX_OST_AW_S_1 : R/W; bitpos: [5:0]; default: 15;
 *  limit the number of outstanding for slave port, default value is 15, max is 32.
 */
#define AXI_IC_REG_MAX_OST_AW_S_1    0x0000003FU
#define AXI_IC_REG_MAX_OST_AW_S_1_M  (AXI_IC_REG_MAX_OST_AW_S_1_V << AXI_IC_REG_MAX_OST_AW_S_1_S)
#define AXI_IC_REG_MAX_OST_AW_S_1_V  0x0000003FU
#define AXI_IC_REG_MAX_OST_AW_S_1_S  0

/** AXI_IC_MAX_OST_AW_S_2_REG register
 *  Config the max outstanding num in current slave write port.
 */
#define AXI_IC_MAX_OST_AW_S_2_REG (DR_REG_AXI_IC_BASE + 0x38c)
/** AXI_IC_REG_MAX_OST_AW_S_2 : R/W; bitpos: [5:0]; default: 15;
 *  limit the number of outstanding for slave port, default value is 15, max is 32.
 */
#define AXI_IC_REG_MAX_OST_AW_S_2    0x0000003FU
#define AXI_IC_REG_MAX_OST_AW_S_2_M  (AXI_IC_REG_MAX_OST_AW_S_2_V << AXI_IC_REG_MAX_OST_AW_S_2_S)
#define AXI_IC_REG_MAX_OST_AW_S_2_V  0x0000003FU
#define AXI_IC_REG_MAX_OST_AW_S_2_S  0

