espressif/esp-idf/components/soc/esp32s31/register/soc/icm_sys_axi_ic_reg.h
/** AXI_IC_MAX_OST_AR_S_0_REG register
 *  Config the max outstanding num in current slave read port.
 */
#define AXI_IC_MAX_OST_AR_S_0_REG (DR_REG_AXI_IC_BASE + 0x390)
/** AXI_IC_REG_MAX_OST_AR_S_0 : R/W; bitpos: [7:0]; default: 15;
 *  limit the number of outstanding for slave port, default value is 15
 */
#define AXI_IC_REG_MAX_OST_AR_S_0    0x000000FFU
#define AXI_IC_REG_MAX_OST_AR_S_0_M  (AXI_IC_REG_MAX_OST_AR_S_0_V << AXI_IC_REG_MAX_OST_AR_S_0_S)
#define AXI_IC_REG_MAX_OST_AR_S_0_V  0x000000FFU
#define AXI_IC_REG_MAX_OST_AR_S_0_S  0

/** AXI_IC_MAX_OST_AR_S_1_REG register
 *  Config the max outstanding num in current slave read port.
 */
#define AXI_IC_MAX_OST_AR_S_1_REG (DR_REG_AXI_IC_BASE + 0x394)
/** AXI_IC_REG_MAX_OST_AR_S_1 : R/W; bitpos: [7:0]; default: 15;
 *  limit the number of outstanding for slave port, default value is 15
 */
#define AXI_IC_REG_MAX_OST_AR_S_1    0x000000FFU
#define AXI_IC_REG_MAX_OST_AR_S_1_M  (AXI_IC_REG_MAX_OST_AR_S_1_V << AXI_IC_REG_MAX_OST_AR_S_1_S)
#define AXI_IC_REG_MAX_OST_AR_S_1_V  0x000000FFU
#define AXI_IC_REG_MAX_OST_AR_S_1_S  0

/** AXI_IC_MAX_OST_AR_S_2_REG register
 *  Config the max outstanding num in current slave read port.
 */
#define AXI_IC_MAX_OST_AR_S_2_REG (DR_REG_AXI_IC_BASE + 0x398)
/** AXI_IC_REG_MAX_OST_AR_S_2 : R/W; bitpos: [7:0]; default: 15;
 *  limit the number of outstanding for slave port, default value is 15
 */
#define AXI_IC_REG_MAX_OST_AR_S_2    0x000000FFU
#define AXI_IC_REG_MAX_OST_AR_S_2_M  (AXI_IC_REG_MAX_OST_AR_S_2_V << AXI_IC_REG_MAX_OST_AR_S_2_S)
#define AXI_IC_REG_MAX_OST_AR_S_2_V  0x000000FFU
#define AXI_IC_REG_MAX_OST_AR_S_2_S  0

/** AXI_IC_AW_QOS_PEAK_RATE_MODE_REG register
 *  Config the aw channel token store mode in peak rate enable.
 */
#define AXI_IC_AW_QOS_PEAK_RATE_MODE_REG (DR_REG_AXI_IC_BASE + 0x39c)
/** AXI_IC_REG_AW_QOS_PEAK_RATE_MODE : R/W; bitpos: [5:0]; default: 0;
 *  peak rate, to control the aw channel request token num more than 1, default 0.
 */
#define AXI_IC_REG_AW_QOS_PEAK_RATE_MODE    0x0000003FU
#define AXI_IC_REG_AW_QOS_PEAK_RATE_MODE_M  (AXI_IC_REG_AW_QOS_PEAK_RATE_MODE_V << AXI_IC_REG_AW_QOS_PEAK_RATE_MODE_S)
#define AXI_IC_REG_AW_QOS_PEAK_RATE_MODE_V  0x0000003FU
#define AXI_IC_REG_AW_QOS_PEAK_RATE_MODE_S  0

/** AXI_IC_AR_QOS_PEAK_RATE_MODE_REG register
 *  Config the ar channel token store mode in peak rate enable.
 */
#define AXI_IC_AR_QOS_PEAK_RATE_MODE_REG (DR_REG_AXI_IC_BASE + 0x3a0)
/** AXI_IC_REG_AR_QOS_PEAK_RATE_MODE : R/W; bitpos: [5:0]; default: 0;
 *  peak rate, to control the ar channel request token num  more than 1, default 0.
 */
#define AXI_IC_REG_AR_QOS_PEAK_RATE_MODE    0x0000003FU
#define AXI_IC_REG_AR_QOS_PEAK_RATE_MODE_M  (AXI_IC_REG_AR_QOS_PEAK_RATE_MODE_V << AXI_IC_REG_AR_QOS_PEAK_RATE_MODE_S)
#define AXI_IC_REG_AR_QOS_PEAK_RATE_MODE_V  0x0000003FU
#define AXI_IC_REG_AR_QOS_PEAK_RATE_MODE_S  0

#ifdef __cplusplus
}
#endif
